{"title":"Recent Readings","books":[{"years":["1998"],"name":"Serendipities_Language_and_Lunacy","stop":"2019-10-07","authors":["Umberto Eco"],"acquired":"2019-05-25","start":"2019-10-01","body":"<p>In a collection of essays, Umberto Eco explores how mistaken reasoning can nonetheless led to important developments and discoveries.  The first essay focuses on forgeries, but the others explore the evolution of languages and how non-modern thinkers thought about the relationships between languages and the dynamic forces that shape them.</p><p>This book is not a light reading.  Eco covers a lot of ground in a very slim book.  Some prior familiarity with the material would definitely help.</p><h3>The Force of Falsity</h3>  <p>People sometimes get taken in by forgeries.  Even when something is wrong, it can still drive people to interesting discoveries.  The letter from Prester John helped motivate Europeans to explore East through Asia and South through Africa.  Columbus had the wrong estimate for the size of the Earth, but it motivated his voyage of exploration that brought knowledge of the Americas to Europe.</p><p>Eco has articulated many of his novels around these forgeries and how people decide to believe them, such as the Donation of Constantine, the letter from Prester John, the Protocols of the Elders of Zion, the Rosicrucians & Templars & Freemasons.</p><p>People found these constructions easier to believe than the complex reality around them.  If Truth has a power all its own, it would seem that False has some too.</p><h3>Languages in Paradise</h3>  <p>Dante tried to recreate the language spoken by Adam.  He inadvertently created a unifying Italian that would help unify the peninsula.  His ideas followed somewhat closely those of Abulafia, a Jewish thinker.  Circa 1300, it is unlikely they ever met one another.  But the ideas they expressed permeated the intellectual atmosphere of the time.</p><h3>From Marco Polo to Liebniz</h3>  <p>Misunderstandings between cultures.  Everyone interprets the world based on their existing expectations.  Marco Polo saw a rhinoceros and could only explain it as a unicorn.</p><p>Kircher saw hieroglyphics as a mysterious original language imbued with mysticism.  And he saw Chinese ideograms as a degenerate version of hieroglyphics.  And he saw Native American pictograms as the work of the Devil.</p><p>Leibniz saw in the <i>I Ching</i> the foundation for a universal mathematical language.  Kircher and Abulafia looked to the past for an original perfect language.  Liebniz, instead, looks to the future and uses rules from other existing languages to construct a new perfect language.</p><h3>The Language of the Austral Land</h3>  <p>People in the 1600's tried to construct perfect languages.  Some of them used combination of rules that reminded me of how we can combine emojis to produce other emojis.  Some also reminded me of Newspeak in <i><a target=\"_blank\" href=\"http://amzn.com/0452284236\">Nineteen Eighty-Four</a></i>.  For Eco, these are all failures that nonetheless led to useful inventions in the Land of the Novel.</p><h3>The Linguistics of Joseph de Maistre</h3>  <p>Joseph de Maistre had strong ideas about languages influence one another.  He hated new forms because they were new, and he liked old forms because they were old.  He could construct convoluted chains of reasoning to show a path between words in different languages, but he also stopped these chains at arbitrary mystical beliefs.</p>","publisher":"Columbia University Press","titles":[{"link":"https://www.amazon.com/dp/0231111347","title":"Serendipities: Language and Lunacy"}]},{"acquired":"2019-08-06","titles":[{"title":"The Great Gatsby","link":"https://www.amazon.com/dp/0743273567"}],"publisher":"Scribner","body":"<p>I read this back in High School.  I had recently seen the Baz Luhrmann movie adaptation and I thought it was time for me to read it again.</p><p>I'd come to realize I remembered very little from the novel.  Maybe it's because it was a school assignment.  Maybe it's because I was a teenager, back then.  Maybe it's because my English was not good enough back then for the level of language in the book.  I vaguely remembered there was an important scene at the Plaza Hotel, but I don't know if I remembered its importance from reading it or from quizzes later in class.  And I vaguely remembered the Valley of Ashes.  And that there was a lot of mystery around the character of Gatsby.</p><p>The movie was a very good refresher, but Baz Luhrmann's vision tends to go far beyond the source material.  I was eager to re-discover the original story and Fitzgerald's unmodified vision.  The introduction talks about how youth and adults can have different interpretations of the story.  I was curious as to how I would perceive it this time around.</p><p>The movie, it turns out, stays pretty close to the book.  It does dial up the extravagance: Gatsby drives recklessly, the parties are over the top.  I liken it to over-saturating the colors in a picture; it's the same picture, but everything in it is dialed up to 11.  One startling difference, though, is that in the book, Gatsby never loses his temper at Daisy the way he does at the Plaza Hotel in the movie.  And the framing device of Nick in an asylum was also in poor taste.</p><p>The book is a nice study in contrasts.  Everywhere you look, the author is comparing things: rich vs. working class, Old Money vs. New Money, responsible vs. careless, yearnings vs. reality.</p><p>Here is an example from when Gatsby's father visits Gatsby's impressive house:</p><blockquote>  <p>He had shown [the photograph] so often that I think it was more real to him now than the house itself.</p><footer>page 172</footer></blockquote>  <p>Gatsby's father had never seen the house before and latched on to the photograph as proof of its existence.  In his mind, the photograph came to replace the actual object.</p><p>It is tempting to apply the same process in Gatsby with regard to Daisy and the green light at the end of her dock.  But here, it is slightly different.  Gatsby is yearning for the green light because it stands closer to Daisy than he is.  Once he's got Daisy by his side, he can forget about the green light and its supposed proximity to Daisy.</p><p>Nick Carraway, the narrator, is always somewhere in the center of Fitzgerald's dichotomies.  His family is somewhat well off, but he still has to work.  He likes to think he is honest and responsible, but he willingly goes along with his friends' extravagances.  He shows some desire for Jordan, but it does not turn into an obsession.  He makes for a nice neutral narrator.</p><p>Everyone else is pretty despicable:</p><blockquote>  <p>They were careless people, Tom and Daisy&mdash;they smashed up things and creatures and then retreated back into their money or their vast carelessness, or whatever it was that kept them together, and let other people clean up the mess they had made...</p><footer>page 179</footer></blockquote>  <p>In the end, Gastby was a character trapped in a past that he had constructed out of thin air.  Tom and Daisy are trapped in the trappings of Old Money.  Jordan is trapped in her own constant dishonesty.  Nick is somewhat relieved to get away from it all.</p>","start":"2019-08-09","years":["1925"],"authors":["F. Scott Fitzgerald"],"stop":"2019-08-30","name":"The_Great_Gatsby"},{"acquired":"2018-06-11","body":"<p>Following <i><a target=\"_blank\" href=\"Books.html#The_Children_of_Hurin\">The Children of H&uacute;rin</a></i> and <i><a target=\"_blank\" href=\"Books.html#Beren_and_Luthien\">Beren and L&uacute;thien</a></i>, Christopher Tolkien pulls out all the Gondolin materials, along with the story of Tuor, son of Huor, and puts them under one set of covers.</p><p>Once again, I appreciated the writing style that suggests old heroic tales and myths.  The archaisms didn't give me too much trouble and contributed to the atmosphere of myth.</p><p>Compared to the material in <i><a target=\"_blank\" href=\"http://amzn.com/0618391118\">The Silmarillion</a></i>, Tuor's travel to Gondolin and the attack on Gondolin are much more fleshed out.  I was already familiar with the longer tellings from my other Tolkien books, so there were fewer surprises for me than with the other stories of T&uacute;rin and Beren and Luthien.  But it was very enjoyable nonetheless.</p>","publisher":"Houghton Mifflin Harcourt","titles":[{"link":"http://a.co/d/1GUBPyW","title":"The Fall of Gondolin"}],"start":"2019-03-27","years":["2018"],"stop":"2019-05-09","authors":["J.R.R. Tolkien","Christopher Tolkien"],"name":"The_Fall_of_Gondolin"},{"start":"2019-02-19","body":"<p>I need to reread this book more often.</p><p>This book is about friendship and what's important in life and it is also about death and loss.  It tackles very deep issues with disarmingly simple language.  It is very modern in its approach by paring things down to the absolute essential but at the same time using poetic elements to convey strong emotions succinctly.</p><p>I cannot accept the English verb <i>to tame</i> as the translation of the French <i>apprivoiser</i> in the text.  <i>Taming</i>, to me, implies changing the nature of the object to render them docile in most circumstances.  In contrast, <i>apprivoiser</i> is about the relationship between two parties, it only changes how they relate to each other and says nothing about each relates to anyone else.  When the fox asks the little prince to tame him, he's not asking to be made into a tamed animal.  He's saying he wants to have a special relationship with this boy.</p><p>Some quotes I really liked this time around:</p><blockquote>  <p>\"Ce que je vois l&agrave; n'est qu'une &eacute;corce.  Le plus important est invisible...\"</p><footer>chapter XXIV</footer></blockquote>  <blockquote>  <p>Mais ce sera comme une vielle &eacute;corce abandon&eacute;e.  Ce n'est pas triste les vielles &eacute;corces...</p><footer>chapter XXVI</footer></blockquote> ","publisher":"Harcourt","titles":[{"title":"The Little Prince","link":"http://amzn.com/0156012197"},{"link":"http://www.amazon.ca/dp/0156013983","title":"<i>Le Petit Prince</i>"}],"acquired":null,"name":"The_Little_Prince_2","stop":"2019-02-19","authors":["Antoine de Saint-Exup&eacute;ry"],"years":["2000","<i>1943</i>"]},{"acquired":"2018-10-15","start":"2018-10-15","body":"<p>Gideon Sterer worked with me as an intern a long time ago.  This book for young readers is a cute concept and it has nice illustrations.  At one point, the text reads \"with broad shield and heavy sword,\" but it would have felt more natural to be as \"with broad swords and heavy shield.\"  Maybe I've been reading too much Homer.</p>","publisher":"Abrams","titles":[{"title":"The Night Knights","link":"https://www.amazon.com/Night-Knights-Gideon-Sterer/dp/1419728466"}],"years":["2018"],"name":"The_Night_Knights","stop":"2018-10-15","authors":["Gideon Sterer","Cory Godbey"]},{"acquired":"2017-05-10","titles":[{"title":"Radical Candor: Be a Kickass Boss Without Losing Your Humanity","link":"http://a.co/65Lo0qh"}],"publisher":"St. Martin's Press","body":"<p>A friend of mine recommended I read this book when it came out.  I'm not sure there wasn't a hidden message behind this recommendation.</p><p>At first, I thought the premise was to have the courage to give criticism, as long as it's about things that you care about.  This seemed interesting enough.  But it turns out the actual premise is all about <i>people</i>: you should care about them personally and you should challenge them directly so they can maximize their potential.  It is about you as a <i>boss</i> having empathy for your direct reports and not shying away from the tough discussions.  It's like being a coach: you have to understand where your players are in their head and steer them towards a common objective, with motivators specific to each one.</p><blockquote>  <p>... Help people conduct their careers in the way <i>they</i> desire, not in the way <i>you</i> think they should want to.</p><footer>page 47</footer></blockquote>  <p>It is a relatively quick read.  And I was right to think that it would be somewhat lightweight and anecdotal, much like <i><a target=\"_blank\" href=\"SoftwareEngineering/Books.html#Rework\">Rework</a></i> and <i><a target=\"_blank\" href=\"SoftwareEngineering/Books.html#Remote_Office_Not_Required\">Remote</a></i>.  For example, she says:</p><blockquote>  <p>Ruinous Empathy is responsible for the vast majority of management mistakes I've seen in my career.</p><footer>page 32</footer></blockquote>  <p>That's still anecdotal.  She is implying that her career has been long enough and varied enough that it is representative of all management in all companies in all countries.  Her career has not been long enough yet to be any of these things.  The plural of <i>anecdote</i> is <b>not</b> <i>data</i>.  All of her stories suffer from a strong selection bias; she picked them because they confirm her hypotheses.</p><p>Contrast these with the following quote by Richard Carrier:</p><blockquote>  <p>They didn't answer by interpreting Scripture or reasoning from the armchair or drawing hasty conclusions from casual observations.  They conducted detailed scientific experiments to find out.</p><footer><a target=\"_blank\" href=\"https://youtu.be/kyrKMIDSVYE?t=18m14s\">Skepticon One Redux</a></footer></blockquote>  <p>Jason Fried, DHH, and now Kim Scott, rely on personal anecdotes that are susceptible to all kinds of biases.  They talk from a position of privilege that may not be representative of their readers.  They were able to do things and take risks that may be completely outside the reach of their general audience.</p><p>Authors like Allen Bluedorn, Robert Sutton, and Tom DeMarco take greater care to remove themselves from the equation.  Anecdotes still inform their premises, but they go to great lengths to confirm them via rigorous studies that use the scientific method to be as objective as possible. <i>Need to verify this for DeMarco.</i></p><p>Kim Scott's sloppiness shows up in small phrases like \"I once read an article that claimed ...\" or \"... as we'll see in later sections\".  It projects an air of authority without giving any foundation for it.  She doesn't do it all the time, sometimes she does give references.  But it weakens her case every time she does.  The stories about AdWords, and those about Steve Jobs, could easily have had references.  And while I can attest to some of the things she says about Google (I was never at Apple, so I cannot speak to that), some dates would have been helpful because I know things have changed over the years and it may not all be true anymore.</p><p>Aside from that, she does make some good points.  Her approach is very humane.</p><blockquote>  <p>Sometimes two people just don't work that well together.</p><footer>page 62</footer></blockquote>  <blockquote>  <p>Everyone can be excellent at <i>something</i>.</p><footer>page 64</footer></blockquote>  <blockquote>  <p>Don't put people in boxes and leave them there.</p><footer>page 74</footer></blockquote>  <p>The humanity comes through especially when she recommends caution before being too candid with your boss.  It is also there when discussing the need to fire people because of performance problems.  They may not be bad people; it's just that the job sucks for them.</p><p>Kim Scott mentions giving feedback immediately, in those 2-3 minutes between meetings.  This is very much like when I give personal instruction during kendo practice.  The more immediate, the better.  But in the middle of practice, I have to be selective of the one actionable piece of advice I have time to give.</p><p>She describes a tool for giving recognition, dubbed the \"Killer Whale\", that resembles what we did at ShopWell with the ShopWheel, or at Directly with flamingoes, but everyone proposes candidates and the previous winner chooses.  But she also had \"Woops the Monkey\" where people self-submit for messing up and they get instant forgiveness.</p><p>Kim Scott also briefly touches on gender bias and gender politics. She describes how having to choose between being likable and being successful hurts women.  I would like to suggest that it hurts plenty of men, too.  The fact that some men get away with it doesn't mean we all get a free pass.  I wonder if it could be about being perceived as strong vs. weak, instead of being about gender per se.</p><p>I'll end with a few more quotable bits.</p><blockquote>  <p>... if Keynes's genius was locked inside his head, it may as well not have existed.</p><footer>page 92</footer></blockquote>  <blockquote>  <p>Is there anything I could do or stop doing that would make it easier to work with me?</p><footer>page 132</footer></blockquote>  <blockquote>  <p>Everyone is watching you, but that doesn't mean it's all about you.</p><footer>page 220</footer></blockquote>  <p><span class=\"newthought\">Note:</span> Radical Candor got a passing mention in an episode of the <a target=\"_blank\" href=\"http://www.greaterthancode.com/2018/09/12/097-the-job-of-a-manager-with-brandon-hays/\">Greater Than Code</a> podcast.</p>  <p><span class=\"newthought\">Note:</span> On 2018-12-17, after having read about candor and caring, I came upon an article titled <a target=\"_blank\" href=\"https://www.theatlantic.com/magazine/archive/2019/01/charles-duhigg-american-anger/576424/\">The Real Roots of American Rage</a> in <i>The Atlantic</i>.  It talks about how anger can be a useful emotion, helping us feel heard when we are angry and focusing our attention when someone is angry at us.  But it is also easy for less well-meaning people to use our anger to manipulate us and even direct us against our best self-interest.</p> ","start":"2018-09-14","years":["2017"],"authors":["Kim Malone Scott"],"stop":"2018-11-13","name":"Radical_Candor"},{"stop":"2018-09-12","authors":["J.R.R. Tolkien","Christopher Tolkien"],"name":"Beren_and_Luthien","years":["2017"],"body":"<p>Following <i><a href=\"#The_Children_of_Hurin\">The Children of H&uacute;rin</a></i>, Christopher Tolkien pulls out all the Beren and L&uacute;thien materials and puts them under one set of covers.</p><p>Having read <i><a href=\"#The_Story_of_Kullervo\">The Story of Kullervo</a></i> gave me a better appreciation for the comparative study of the many version of a text and see its evolution.  I used to be annoyed by earlier versions of beloved texts, with their unfamiliar names, contradictory details, and ragged beginnings and ends.  But here, I really liked all these idiosyncrasies.</p><p>Once again, Christopher Tolkien limited the editorial work he had done previously in <i><a target=\"_blank\" href=\"http://amzn.com/0618391118\">The Silmarillion</a></i> and tried to present as cohesive a text as possible out of all the different versions found in <i>The History of Middle-Earth</i>.  And once again, mission accomplished.  The introduction does its best to set the stage and manage expectations of readers unfamiliar with J.R.R. Tolkien's tales of the Elder Days.</p><p>It was nice to see all the additional details for some of the scenes.  Like the material regarding Tevildo, Prince of Cats, for instance, and the strange names of his thanes: Oikeroi, Umuiyan, Miaul&euml;; names unlike anything else in the works of J.R.R. Tolkien.</p><p>I liked the writing style too; it suggests old heroic tales and myths. I tripped quite a few times in the older texts where the archaic word <i>an</i> is used to mean <i>if</i>.  The other archaisms didn't give me much trouble and contributed to the atmosphere of myth.  For example:</p><blockquote>  <p>So thou has returned too - bringing a Silmaril , beyond doubt, in recompense for all the ill thou hast wrought my land; or <b>an</b> thou hast not, I know not wherefore thou art here.</p><footer>page 82</footer></blockquote>  <p>Independently, I stumbled on this bit about <i>epic poetry</i> while looking up something about <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Beowulf\">Beowulf on Wikipedia</a>:</p><blockquote>  <p>Beowulf is considered an epic poem in that the main character is a hero who travels great distances to prove his strength at impossible odds against supernatural demons and beasts.</p></blockquote> ","publisher":"Houghton Mifflin Harcourt","titles":[{"title":"Beren and L&uacute;thien","link":"http://a.co/9En3O9B"}],"start":"2018-08-02","acquired":"2017-12-25"},{"acquired":"2018-04-23","body":"<blockquote>  <p>'The fox knows many things, but the hedgehog knows one big thing.'</p><footer>page 1</footer></blockquote>  <p>From the blurb at the back of the book, I thought it would be a discussions of generalists versus specialists, with Tolstoy as an example.  That was not quite it.</p><p>First, Berlin admits right off the bat that the metaphor may be a bit of a stretch.</p><blockquote>  <p>Of course, like all over-simple classifications of this type, the dichotomy becomes, if pressed, artificial, scholastic and ultimately absurd.</p><footer>page 2</footer></blockquote>  <p>What started as a parlor trick: find an arbitrary criteria and use it to partition a group of people, is a mere pretext to introduce a lengthy discussion of Tolstoy and how his philosophy is expressed in <i>War and Peace</i>.  The metaphor can still be useful when it provides a new dimension with which to explore a topic.  But in Berlin's case, it has become he's best-known contribution.  It felt like Frankenstein and his monster, where the creation takes over the life of its creator.</p><p>I haven't read <i>War and Peace</i>, but I did see the 2016 BBC production, so at least I was able to follow somewhat what Berlin was talking about.  Tolstoy had a view of history similar to calculus: the force driving history is the integral of an infinite number of insignificant events.  Any attempt to reduce it to specific actors or events is futile.  Tolstoy showed great genius at destroying such attempts at reduction, but he was never able to resolve the integral to reveal what drives history.  It got me thinking of chaos theory and strange attractors.  It also got me thinking of the movement of electrons in a conductive material, where they bounce around between atoms somewhat at random but overall <i>slowly</i> drift in the direction of the electric current.</p><p>Berlin contends that Joseph de Maistre was a big influence on Tolstoy.  He had the same contempt for highfalutin intellectuals and also believed in a higher power.  Only, his was the Catholic Church.</p><p>They both agreed that warfare is an intrinsically unpredictable.  This quote by Maistre:</p><blockquote>  <p>Vaincre, c'est avancer.  Mais quel est celui qui avance? c'est celui dont la conscience et la contenance font reculer l'autre.</p><footer>page 60</footer></blockquote>  <p>Indicates that the winner is the one whose determination is stronger than the others and puts them on the defensive.  Much like in kendo.</p><p>The appendix confirms my impressions that Berlin can be a little long-winded.  Like when he uses the word <i>circumambient</i>.  (Incidentally, it's the title of a song by Grimes)</p><p>I received this book as part of a White Elephant book exchange at work.  I'm glad that I learned a lot while reading it, but I'm still a little disappointed that my early expectations of a discussion of generalists versus specialists weren't met.</p>","publisher":"Princeton","titles":[{"link":"http://a.co/gf9DAjh","title":"The Hedgehog and the Fox"}],"start":"2018-06-13","years":["1951","1953","2013"],"stop":"2018-07-05","authors":["Isaiah Berlin"],"name":"The_Hedgehog_and_the_Fox"},{"years":["161-180","2006"],"name":"Meditations","authors":["Marcus Aurelius","Martin Hammond"],"stop":"2018-03-01","acquired":"2017-10-14","start":"2018-01-01","titles":[{"title":"Meditations","link":"http://a.co/3AzFC0V"}],"publisher":"Penguin Classics","body":"<p>Marcus Aurelius is a major figure of the Stoics.  This book looked like a recent translation with an introduction and lots of notes.</p><p>This text is nearly 2,000 years old.  It has stood the test of time and it has been studied by many, many scholars.  Whatever critique I might have, I must remember to weigh it against the opinions of all these learned people that have reflected on these meditations over the centuries.</p><p>On the other hand, neither Marcus Aurelius nor most of these learned scholars have any notion of psychology.  Or medicine and diseases and microbes.  Or modern Physics.</p><p>The writing style feels a lot like stream of consciousness.  Marcus Aurelius switches back and forth between topics and revisits the same thoughts in multiple <i>books</i>.  I had to constantly remind myself that he was writing to himself, not to some hypothetical reader.  This is a Roman emperor writing to a Roman emperor, not to an ordinary citizen.</p><p>Marcus Aurelius often contrasts Epicurus (we are assemblies of atoms, we should seek out pleasures and avoid pain) and Epitectus (we should be indifferent to external events).  But instead of trying to reconcile them, he holds both views at the same time and shows how they both lead to the same end (see 6.10).</p><p>One recurring theme is that each one of us us but a part of the larger universe as a whole.  We are doing <i>good</i> when we are fulfilling our role in that larger whole, and <i>bad</i> when we act against that goal.  The whole does not concern itself with the fate of individual parts, and it is sometimes necessary for the part to suffer for the benefit of the whole.  Much like an individual soldier's death may be their part in the overall victory.</p><blockquote>  <p>All that happens to the individual is to the benefit of the Whole.</p><footer>6.45</footer></blockquote>  <blockquote>  <p>What does not benefit the hive does not benefit the bee either.</p><footer>6.54</footer></blockquote>  <blockquote>  <p>Whatever position a man has taken up in his own best judgement, or is assigned by his commander, there, it seems to me, he should stay and face the danger, giving no thought to death or anything else before dishonor.</p><footer>7.45</footer></blockquote>  <p>This last quote is actually Marcus Aurelius quoting Plato, who was himself quoting Socrates.</p><p>Another theme is that the universe is in constant renewal.  The cycle of birth, life, and death is a natural part of that.  The universe can only create new forms by breaking down and recycling old ones.  Each one of us is but a tiny portion of space and time out of the entire universe, and quite insignificant all by our own.</p><blockquote>  <p>Universal nature uses the substance of the universe like wax, making now the model of a horse, then melting it down and using its material for a tree; next for a man; next for something else.  Each one of these subsists for only the briefest time.</p><footer>7.23</footer></blockquote>  <blockquote>  <p>The wind scatters one year's leaves on the ground ... so it is with the generations of men.  [...]  All these 'come round in the season of Spring': but then the wind blows them down, and the forest 'puts out others' in their stead.</p><footer>10.34</footer></blockquote>  <p>Marcus Aurelius has a hierarchy from the inanimate, to animate, to conscious, to rational beings (7.55).  Not everyone actually lives up to being rational, and are therefore not fulfilling their full potential.  The duty of rational beings is to help one another and pursue the designs of the universe, so we need to be forgiving of each other's shortcomings.</p><blockquote>  <p>Live out your life in truth and justice, tolerant of those who are neither true nor just.</p><footer>6.47</footer></blockquote>  <blockquote>  <p>[...] do not dwell on all the various troubles which may have occurred in the past or may occur in the future.  Just ask yourself in each instance of the present: 'What is there in this work which I cannot endure or support?'</p><footer>8.36</footer></blockquote>  <blockquote>  <p>To be angry with them is no less a weakness than to abandon your course of action and capitulate in panic.</p><footer>11.9</footer></blockquote>  <blockquote>  <p>If it is not right, don't do it: if it is not true, don't say it.</p><footer>12.17</footer></blockquote>  <p>And I like how he extolls us to seek intrinsic satisfaction in our actions, instead of insisting on extrinsic rewards.  Fame is short-lived and not worth it.  It is better to seek satisfaction in being one with the universe by playing the part assigned to us.</p><blockquote>  <p>[...] you do not yet love your fellow men from your heart: doing good does not yet delight you as an end in itself; you are still doing it as a mere duty, not yet as a kindness to yourself.</p><footer>7.13</footer></blockquote>  <blockquote>  <p>The fault is clearly your own, [...] if you conferred a favour without making it an end in itself, your very action its own end and complete reward.</p><footer>9.42.4</footer></blockquote>  <blockquote>  <p>[...] it is madness to expect bad men to do no wrong: that is asking for the impossible.  But it is cruel tyranny to allow them such behaviour to others while demanding that they do no wrong to you.</p><footer>11.18.11</footer></blockquote>  <blockquote>  <p>At their festivals the Spartans would put seats for visitors in the shade, and sit themselves wherever they could.</p><footer>11.24</footer></blockquote>  <p>Even if at times a little ironic.</p><blockquote>  <p>[...] you will find it quite easy to face death if you stop to consider the business you will be leaving and the sort of characters which will no longer contaminate your soul.</p><footer>9.3.2</footer></blockquote>  <p>In the duality of mind and body, the directing mind reigns supreme.  It must not get distracted by the body and it is solely responsible for itself.  Marcus Aurelius believed that external events could only influence the directing mind if it chooses to let them do so.  I'm not sure what he would say about modern psychological methods, but he definitely thought you could retreat into your mind and ignore anything you choose.</p><blockquote>  <p>The mind adapts and turns round any obstacle to action to serve its objective: a hinderance to a given work is turned to its furtherance, an obstacle in a given path becomes an advance.</p><footer>5.20</footer></blockquote>  <blockquote>  <p>All that happens is an event either within your natural ability to bear it, or not.  So if it is an event within that ability, do not complain, but bear it as you were born to.  If outside that ability, do not complain either: it will take you away before you have a chance for complaint.  Remember, though, that you are by nature born to bear all that your own judgement can decide bearable, or tolerate in action, if you represent it to yourself as benefit or duty.</p><footer>10.3</footer></blockquote>  <blockquote>  <p>[...] 'clarity of mind' was meant to signify for you discriminating attention to various detail and vigorous thought; 'a cooperating mind' the willing acceptance of the dispensation on the universal nature; 'independence of mind' the elevation of your thinking faculty above the calm or troubled affections of the flesh, above paltry fame or death or any other indifferent thing.</p><footer>10.8</footer></blockquote>  <p>While the translation and commentary are brilliant, there were a few chapters  (6.26, 7.17, 7.24, 10.7) where the meaning seemed obvious to me but Hammond would call it <i>obscure</i> and say he was <i>uncertain what Marcus meant there</i>.  These often dealt with the discriminating mind asserting dominion over emotions, not succumbing to anger or distraction or bad habit.</p><p>One last quote:</p><blockquote>  <p>For lack of practice the left hand is awkward for most tasks, but has a stronger grip on the bridle than the right - it is practised in this.</p><footer>12.6</footer></blockquote>  <p>Here, Marcus Aurelius is not saying that the left hand is good for nothing, but rather that we must keep practising if we want to get better.  We are good at the things we practise; whether that's horse riding for him or kendo for me.</p><p>A few stats:</p><div class=\"container\"><div class=\"header\">Book</div><div class=\"header\">Chapters</div><div class=\"header\">Pages</div><div class=\"header\">Notes</div><div>1</div><div>17</div><div>7</div><div>8</div><div>2</div><div>17</div><div>6</div><div>9</div><div>3</div><div>16</div><div>7</div><div>5</div><div>4</div><div>51</div><div>12</div><div>7</div><div>5</div><div>37</div><div>11</div><div>8</div><div>6</div><div>59</div><div>12</div><div>11</div><div>7</div><div>75</div><div>13</div><div>7</div><div>8</div><div>61</div><div>12</div><div>8</div><div>9</div><div>42</div><div>11</div><div>8</div><div>10</div><div>38</div><div>11</div><div>6</div><div>11</div><div>39</div><div>10</div><div>8</div><div>12</div><div>36</div><div>8</div><div>6</div></div>  <p>There are 90 pages of notes for 122 pages of text.</p>"},{"name":"Star_Wars_Super_Graphic","authors":["Tim Leong"],"stop":"2017-12-23","years":["2017"],"start":"2017-12-23","publisher":"Chronicle Books","titles":[{"title":"Star Wars Super Graphic: A Visual Guide to a Galaxy Far, Far Away","link":"http://a.co/aOFJLNS"}],"body":"<p>I got this book as a gift from other Star Wars fans at the office.  It is a funny compendium of facts about the Star Wars universe, presented as infographics.  Some is mildly interesting, some is rather far-fetched, some is completely bogus.  Makes a nice present for any Star Wars fan.</p>","acquired":"2017-12-08"},{"years":["2010","2015"],"name":"The_Story_of_Kullervo","authors":["J.R.R. Tolkien","Christopher Tolkien"],"stop":"2017-12-16","acquired":"2017-10-14","start":"2017-11-17","publisher":"Houghton Mifflin Harcourt","titles":[{"link":"http://a.co/7nVM1Wd","title":"The Story of Kullervo"}],"body":"<p>The book has three parts: Tolkien's <i>The Story of Kullervo</i> itself, essays he wrote on the Finnish <i>Kalevala</i>, and a final essay by editor Verlyn Flieger on how Tolkien drew inspiration from Finnish stories.</p><p>In <i>The Story of Kullervo</i> Tolkien is giving his own rendition of the story of Kullervo from the <i>Kalevala</i>, adding his own touches.  Just like Elias L&ouml;nnrot first collected Finnish stories in the early 19th Century and synthesized them, taking some creative liberties, Tolkien is going a step further, re-imagining some of the names and streamlining the plot somewhat.  He is not aiming for an authentic rendition of the Finnish of Kullervo, but rather he is expressing how the story resonated in his mind, how it fired up his imagination, how he saw it unfolding.</p><p>The essays are two versions of talks Tolkien gave at Oxford about the <i>Kalevala</i> and Finnish lore.  In them, you can feel how Tolkien essentially fell in love with a certain version of Finnish culture.</p><blockquote>  <p>I am very fond of these poems.</p><footer>page 99</footer></blockquote>  <p>He extolls the uniqueness of the material in the <i>Kalevala</i> and the quaint charm of the folklore from Finland.  These stories go hand-in-hand with the landscape of Finland, its language, and the singing tradition in which they are told.  We get to see the genesis of Tolkien's narrative style and especially the oddity that is the character of Tom Bombadil in <i>The Lord of the Rings</i>.  With his magic based in songs and his love and dominion over his domain in the Old Forest, he looks like Tolkien's re-imagining of V&auml;in&auml;m&ouml;inen.</p><p>Also, his description of the nature of the Finnish language reminded me of a French children' song that describe the processing of wool.  The song playfully changes the proper termination of words just to make them rhyme.  For example:</p><pre>    Tondons, tondaine\n    La laine des moutaines\n    Tondons, tondaine\n    La laine des moutons\n</pre><p>The words \"tondaine\" and \"moutaines\" do not exist in French.  They are transformations of \"tondons\" (to shear) and \"moutons\" (sheep) made especially for the song to make them rhyme with \"laine\" (wool).  In this simple nursery rhyme, I think French speakers can find a small taste of the playful sound of the Finnish <i>runos</i> that make up the <i>Kalevala</i>.</p><p>The final essay by editor Verlyn Flieger traces the lineage for how the Finnish Kullervo leads to Tolkien's <i>The Story of Kullervo</i>, which leads to <i>The Silmarillion</i>, <i>The Hobbit</i>, and <i>The Lord of the Rings</i>.  She clearly traces how elements of Kullervo become part of the story of T&uacute;rin Turambar in <i>The Silmarillion</i>, down to the speech from his sword before he dies.  She also postulates on how some of these elements also resonate with Tolkien's own life: he lost his father and then his mother at a young age, he was fostered by relatives, and he was at first kept away from the girl he loved.</p><p>I will end with last quote:</p><blockquote>  <p>... all obey the great Rule of the Game in the Kalevala which is to tell at least three lies before imparting any accurate information however trivial.  It had become I think a kind of formula of polite behaviour, for no one seems to believe you until your fourth statement (which you modestly preface with 'all the truth I now tell you, though at first I lied a little').</p><footer>page 82</footer></blockquote> "},{"years":["2002"],"authors":["Allen C. Bluedorn"],"stop":"2017-09-15","name":"The_Human_Organization_of_Time","acquired":"2013-01-16","publisher":"Stanford Business Press","titles":[{"link":"http://amzn.com/0804741077","title":"The Human Organization of Time: Temporal Realities and Experience"}],"body":"<p>Back when I was reading <i><a href=\"#Good_Boss_Bad_Boss\">Good Boss, Bad Boss</a></i>, I came upon a discussion of stand-up meetings that referenced \"The Effects of Stand-Up and Sit-Down Meeting Formats on Meeting Outcomes\" by Bluedorn et al.  Digging a little further led me to this book.</p><p>The description promises a discussion on the nature of Time, how we perceive it, and how human constructs are built around it.  Sounds fascinating.  And boy, does it deliver!</p><p>First, a note on form.  The book reads very much like a scientific paper.  There are a lot of interesting factoids, but every major assertion is backed either by the author's own research or by that of others.  Eco and Kundera can synthesize all the knowledge they've accumulated throughout their career, but their books read more like their own thoughts and opinions than something laboriously research.  Fried and DHH just draw endlessly from their one anecdote.  Here, Bluedorn is doing <i>Science</i>.  The rigor and attention to details are beautiful to see (if sometimes tedious) and lend much more weight to the material.</p><p>Now, on to substance.</p><blockquote>  <p>Time is the fundamental dimension of our existence.</p><footer>Prigogine, page 20</footer></blockquote>  <blockquote>  <p>In the form of time is to be found the form of living.</p><footer>Elliott Jacques, epigraph</footer></blockquote>  <p>Time is essential to how we conduct our lives, from undertaking the day's activities (what is a <i>day</i>, anyway?), to how we conceive our place in the cosmos, and everything in between.  Our lives are governed by a multitude of interacting rhythms, like the day-night cycle or the work day or the calendar.  How these rhythms interact and how we reacts to them varies tremendously between cultures and between individuals.</p><blockquote>  <p>In the seventeenth century both Cervantes and Newton wrote about time.  Yet they reached fundamentally different conclusions about this abstruse phenomenon.</p><footer>page 20</footer></blockquote>  <p>Cervantes wrote about a subjective perception of time that is specific to the individual.  Newton wrote about an objective time that does not depend on the observer, closer to what a clock is measuring.  The book also draws a distinction between <i>epochal</i> time, more subjective and tied to events, and <i>fungible</i> time that is the same no matter what.  An hour is an hour.  Funny enough, before the advent of reliable mechanical clocks, day and night were each divided into twelve \"hours\".  Since the length of days and nights varies throughout the year depending on latitude, hours would be longer or shorter depending on the season.</p><p>Time is a nebulous concept and these are different aspects of it, akin to <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Blind_men_and_an_elephant\">the blind men and the elephant</a>.  Here is a nice example: Bluedorn has a watch that tells time, which ties him to fungible time, and ancient sundials, and the primordial day/night cycle.  But his watch was an anniversary present, so it also ties him to more the personal experiences of his wedding and its 25th anniversary.  The watch stands at multiple positions on the continuum between fungible time and epochal time, depending on the perspective.</p><p>Another aspect the book delves into is <i>polychronicity</i>, the preference for engaging in activities in parallel or one after the other.  There is a continuum that goes from doing one thing at a time (monochronicity) to two, three, or more things in parallel.  It can apply at the micro level, such as ordinary multitasking, and it can apply at the macro level, such as \"detailed planning followed by execution\" (monochronic) versus \"make corrections as you go\" (polychronic).  Despite a number of studies, there is no clear evidence that one end of the spectrum is arbitrarily better than the other.  It depends a lot on the context and the type of work being done.  It is also not clear if a person or organization or society's place on that spectrum is stable, or if they go in and out of it.</p><p>Punctuality became important with the Industrial Revolution, where factories needed to coordinate many tasks.  It was helped by ever more precise time pieces.  But even then, what constitute <i>on time</i> varies greatly by society and activity.  This quote shows that even ancient Romans complained about the tyranny of the clock, even though in his case it was a simple sundial:</p><blockquote>  <p>May the Gods confound that man who first disclosed the hours, and who first, in fact, erected a sun-dial here; who, for wretched me, minced the day up into pieces.</p><footer>Plautus, page 89</footer></blockquote>  <p>Fun fact: Bluedorn shows a punctuality award that his grand-mother received when she was a little girl.  As I was clearing out my parents' basement, I found some of the same that I received back in grade school.  That's an interesting connection.</p><p>Bluedorn explores the concepts of <i>temporal focus</i>, whether someone is focused more on the past or the future, and <i>temporal depth</i>, how far into the past or future someone tends to look.  Where do you draw the line between near-, mid-, and long-term, between recent and distant past?  It is interesting to note that people who look far into the past also look far into the future, and conversely, people who do not look far into the past tend to think more short-term about the future.  The age of a person or culture has a strong influence on how far they look into the past, and therefore into the future.  The book briefly mentions <a target=\"_blank\" href=\"http://longnow.org\">The Long Now Foundation</a>, and their 10,000 Year Clock project, as an example of long term thinking into the future.  He also mentions how, in linguistics, the use of the future perfect tense can make the future more concrete by casting that future into the past.</p><p>While he was gathering data, Bluedorn noticed that people's answers varied depending on whether he ask them to think about the past first, or about the future first.  How far they looked into the past was pretty consistent, but they tended to have a longer future horizon if they had been asked to think about the past beforehand.  This is a nice example of psychological priming and a reminder that the order of questions in a survey can affect the results.</p><p>One of the strongest points of the book, for me, was the relationships between past, present, and future.  At a fundamental level, <i>meaning</i> comes from the connections between things.  It is our connection to the past that gives the present any meaning.  This, in turn, sets up our hopes for the future.  More connections to a deeper past can generate a strong sense of meaning.  And using the past as a predictor for the future, it can make use very hopeful.  Conversely, a lack of connection to the deep future can lead to despair.  Modern shallow temporal depth gives us fewer opportunities for connections, but we can manufacture stand-ins, such as the tomb of the unknown soldier and other commemorative monuments.</p><p><i>Carpe diem</i>: how do people make the best of the time they have?  Planning implies connection to the past and project into the future.  It might have helped evolution for intra-group cooperation and inter-group competition.  The flip side of planning is that procrastination can lead to a feeling of missed opportunities and falling behind.  The book briefly touches on the importance of work-life balance and one's perceived control of time.  To control your time is to control your life.  Taylor confused the quantity of work that was possible from the quantity of work that was desirable.  Young children have pure play (for its own sake), that gradually fades away to be replaced by games and organized activities (whose motivation lies outside of them: winning, surviving, etc.).</p><p>I'm going to close with the author's strange fascination with Daylight Saving Time.  He's looked at and conducted some research into people's behavior when we go in and out of DST and identified some unwanted disruptions.  He therefore advocates for getting rid of DST.  But he totally ignores the reasons we have DST in the first place.  I don't know if the economic incentives are still relevant, but it seems worth it to have a balanced look at this topic.  Perhaps the benefits outweigh the inconveniences.</p><p>The book is really dense with information and these notes leave out a lot more.</p><p>On 2018-05-29, <a target=\"_blank\" href=\"https://zachholman.com/\">Zach Holman</a> wrote <a target=\"_blank\" href=\"https://zachholman.com/talk/utc-is-enough-for-everyone-right\">a lengthy article about time</a> that nicely complements this book.</p>","start":"2017-02-24"},{"acquired":"2016-02-19","titles":[{"title":"Numero Zero","link":"http://amzn.com/0544635086"}],"publisher":"Houghton Mifflin Harcourt","body":"<p>The last book by Umberto Eco, who passed away on 2016-02-19.  He used all of his tricks in making this one.  From the opening, where the narrator believes someone was in his apartment while he was asleep, like in <i><a href=\"#The_Prague_Cemetery\">The Prague Cemetery</a></i>, to the end where the narrator's girlfriend debunks his crazy conspiracy theories using common sense, like in <i><a target=\"_blank\" href=\"http://amzn.com/0151327653\">Foucault's Pendulum</a></i>.  He even manages to squeeze in a paragraph in the style of his article <i><a href=\"#Inventing_the_Enemy\">Living by Proverbs</a></i>.</p><p>True to Eco's style, the novel operates at multiple levels.</p><p>The first chapter introduces a narrator whose memory is unreliable.  Most of the novel is told in a long flashback.  But since his memory is unreliable, how much can we trust what he is telling us?</p><p>The main device of the novel is a newspaper that reports on past events as if they had just happened.  It uses hindsight on those events to make <i>predictions</i> that will have turn out to be true, making it look like the newspaper had foresight, when it was just hindsight.  As a proof of concept, they invent issues from one year prior that hint at what developed in the year since.  Now, the novel itself is set in 1992 but was published in 2015.  Does it try to be prophetic about the impact that events in 1992 would have in the following 20+ years?  I'm not familiar enough with Italian politics to answer this.</p><p>In chapter two, we learn the narrator, Colonna, is \"fifty or so\" years old in 1992.  Eco himself was born in 1932 and was 60 in 1992.  They are both from Northern Italy and studied literature in college.  Colonna could work as a proxy for the author, much like the protagonist in <i><a href=\"#La_misteriosa_fiamma_della_regina_Loana\">The Mysterious Flame of Queen Loana</a></i>.</p><p>One of the themes is how the media are manipulating public opinion for purely capitalistic reasons.  It foreshadows the commercialization of news departments in the years since 1992.  Eco uses these moments to show how writers can manipulate the mind of their readers and create different effects with the words they choose to use or not to use.  This is another literary concept that is dear to Eco.</p><blockquote>  <p>It's not the news that makes the newspaper, but the newspaper that makes the news.</p><footer>page 47</footer></blockquote>  <p>This theme is closely related to what Eco explored in <i><a target=\"_blank\" href=\"http://amzn.com/0156029065\">Baudolino</a></i>, where the main character believes he can manufacture reality simply by inventing it in his mind.  If a lie is repeated often enough, people can start believing it is true.</p><p>Another theme deals with hermetic knowledge: the idea that all things are related and you can deduce a relationship between two things by looking at two other, separate things.  As secret societies develop to protect some secret knowledge, someone with the right hermetic knowledge might be able to piece together the secret by gathering and analyzing other pieces of evidence.  This was the central theme of <i>Foucault's Pendulum</i>; and that whether or not the secret is real does not matter, as long as there are people who believe in it and will do anything to defend them.</p><blockquote>  <p>Everything always fits with everything else, you just have to know how to read the coffee grounds.</p><footer>page 131</footer></blockquote>  <p>Eco doesn't believe in hermetic knowledge, but it makes great fodder for conspiracy theories.  And those make good stories.</p><p>An interesting subplot revolves around how can one person know what another person is experiencing?  The communicator has a mental model in their head and sends messages to transfer that model into their targets' head.  Maia's character keeps sending messages that are misinterpreted, leading others to think she might be autistic, unable to understand that someone else might be thinking something different from her.  As her relationship with Colonna develops, the two of them \"think what the other thinks\", meaning their mental models are more in sync and require less messaging to communicate.</p><p>One last quote:</p><blockquote>  <p>the pleasures of erudition are reserved for losers.</p><footer>page 9</footer></blockquote>  <p>Colonna doesn't have any achievements that extend beyond his person, so he considers himself a loser.  He takes pleasure in intellectual pursuits, I suspect much like Eco himself did.  By the end of the novel, Colonna and Maia have resolved themselves to an ordinary, insignificant life, but one which they will enjoy.</p>","start":"2016-05-02","years":["2015"],"authors":["Umberto Eco"],"stop":"2016-05-13","name":"Numero_Zero"},{"body":"<p>Insignificance has a negative connotation, but Kundera sets out to write a <i>celebration</i> of insignificance.  He shows us how things that are insignificant to the group can be important to the individual: the small thoughts that matter only to us and are unique to each of us.  In the day to day, we concerns themselves with things that matter to us in the moment but that are not that important in the long term, and usually, we're the only ones who care.</p><p>Each character in the novel has their own preoccupation.  It generates deep thoughts in them in private, but reveal their insignificance when they are shared with others.  Alain never really knew his mother and thinks a lot about his place in the world.  Caliban invents a fake Pakistanese identity that only amuses him.  An imaginary Staline takes pleasure in abusing Kalinin, but he's the only one who knows about it.</p><p>At the other extreme, La Franck is vain and shallow.  She tries to make an insignificant moment profound for others to prop herself up, but it falls flat and she leaves.</p><p>There is a dialog towards the end that I feel is key.  The characters discuss how you don't get to pick your looks, your gender, where you were born, when you were born, your mother; yet these factors are critical to how your life will unfold.  Next to them, all the other <i>human rights</i> that we think are so important are really futile.</p>","publisher":"Gallimard","titles":[{"link":"http://amzn.com/2070145646","title":"La f&ecirc;te de l'insignifiance"},{"title":"The Festival of Insignificance: A Novel","link":"http://amzn.com/0062356895"}],"start":"2015-04-30","acquired":"2015-01-02","stop":"2015-06-06","authors":["Milan Kundera"],"name":"La_fete_de_l_insignifiance","years":["2014"]},{"years":["2012"],"stop":"2014-11-05","authors":["Marc-Andr&eacute; Decoste"],"name":"Les_mots_de_la_delivrance","acquired":"2012","body":"<p>First novel by a friend of mine from college.  We both studied computer science and then had long careers in software.  Now, he's written and self-published his first novel using <a target=\"_blank\" href=\"http://lulu.com/\">lulu.com</a>.</p><p>The novel suffers from all the ailments you'd expect from a first-time writer.  I had several issues with both style and substance.</p><p>The basic plot is a teenage high school drama with a shy but smart protagonist, a sparky and empathic love interest, a courtyard bully, and inept adults.  The core story deals with the reclusive Daniel coming out of his shell and taking an active part in his life instead of just observing it.  He gravitates towards highbrow subjects in an effort to make himself interesting, but only comes off as shallow.  This extends to his relations with other characters where he shows a total inability to stay in a conversation that does not go precisely as he wants.  He consistently overreacts to the slightest contradiction.</p><p>The plot attempts to introduce a murder investigation, but the characters only have a vague rumor to go on.  This subplot is totally preposterous.  The reader and characters have nowhere near enough information to build a credible theory of the crime.  The result is that the characters look either paranoid or stupid (or both) to the reader, making it difficult to identify with them.</p><p>Another subplot deals with suicide.  This is not the desperate form of suicide as the only way to escape from an intolerable reality.  It is the depressed form of suicide where death might offer a respite from the weight of everyday life.  The angle could have been interesting, but it is merely exposed and never pursued any further.  There are numerous other philosophical questions that are just dropped in and then go no further.  The effect is only pedantic.</p><p>The novel spends its first 90% setting up characters and a mood only to throw it all away in the last 10%.  It goes in a totally different direction that bears little to no resemblance to the novel that preceded it.  I felt cheated.  I had worked real hard to like the novel up to that point, in spite of all its flaws.  I had to throw all that away and try again from scratch.</p><p>Lastly, I have two issues with his writing style.  The overall writing suffers from wordiness.  Right from the first paragraph</p><blockquote>  <p>La cloche retentit.  Un murmure se fait graduellement entendre, tel un troupeau lointain qui s'approche &agrave; grands pas.  Le sol vibre comme pour avertir une proie de l'approche imminente de pr&eacute;dateurs en furie.  Les hauts murs, partiellement habill&eacute;s de casiers en m&eacute;tal, r&eacute;fl&eacute;chissent le bourdonnement pour en amplifier la cacophonie.  Le brouhaha envahit soudainement la grande salle.  Les corridors, tels des volcans en &eacute;ruption, crachent des &eacute;tudiants par dizaines.</p></blockquote>  <p>Which roughly translates to:</p><blockquote>  <p>The bell rings. A murmur is heard gradually, as a distant herd is approaching briskly. The floor vibrates as if to warn a prey of the impending approach of raging predators. The high walls, partially dressed in metal lockers, reflect the buzz to amplify the cacophony. The hubbub suddenly invades the main hall.  The corridors, like volcanoes that are erupting, spew students by the tens.</p></blockquote>  <p>Each sentence evokes multiple clashing images and only confuse the reader.  One sentence has a <i>herd</i> as the source of the noise, and the next sentence has <i>predators</i> as the source.  Predators don't move in herds, so the mind of the reader would not normally make the connection.  Next, we have three different words very close to each others to describe the sound of the approaching crowd.  The mind just spins.  From herds to preys to predators to metal-dressed to noise to volcanoes.  And all for just a few tens of students.  At the end of it all, I'm left underwhelmed.</p><p>My second issue with the style is when the characters are speaking.  The action takes place in a Montreal suburb, so the characters inject some local flavor in their speech patterns.  But it is very inconsistent.  Sometimes, they'll drop in and out of the vernacular within a single paragraph.  People don't talk like that.  In a given conversation, it's all in or all out.  I really enjoyed the attempt at local flavor, which made it even more annoying when it was erratic.</p><p>I'm gonna stop here, now.  The author is a good friend and I don't want to overdo the harping.  I'm glad he actually got a novel out and I'm excited to see how he will evolve as a writer.</p>","titles":[{"link":"http://www.lulu.com/product/hardcover/les-mots-de-la-d%C3%A9livrance/18901675","title":"Les mots de la d&eacute;livrance"}],"publisher":"Cr&eacute;ations MAD","start":"2014-10-21"},{"stop":"2014-07-20","authors":["Umberto Eco"],"name":"Inventing_the_Enemy","years":["2011","2012"],"body":"<p>The book is another collection of essays written by Umberto Eco for various conferences.  The opening essay, <i>Inventing the Enemy</i>, is somewhat approachable, though he does lay the anti-semitic descriptions rather thick.  By the time I started the second essay, I was wondering if I had bitten more than I could chew; a recurring possibility with Eco.</p><p>In the preface, Eco explains that each essay was an imposed subject for some conference or journal article.  It shows in that most of them are rambling thoughts with no clear conclusion.  They are fanciful intellectual explorations that meander more than they enlighten.</p><h3>Inventing the Enemy (2008)</h3>  <p>We often define ourselves by opposition to an \"enemy\", even creating an imaginary one if there are no real enemies at hand.  We reuse the same elements to describe this enemy and vilify them, whether the manufactured \"enemy\" is Jews, women, Arabs, or any other group.</p><blockquote>  <p>Having an enemy is important not only to define our identity but also to provide us with an obstacle against which to measure our system of values and, in seeking to overcome it, to demonstrate our own worth.</p><footer>page 2</footer></blockquote>  <p>Jean-Paul Sartre reduced this theme to its simplest form in his novel <i>No Exit</i>, which I had to read when I was in high school.</p><h3>Absolute and Relative (2007)</h3>  <p>A rather dense discussion of absolutism, relativism, and holistic thinking.  He cleverly quotes classical and modern writers. Whatever it is we decide to believe, there are objective truths in the world that won't be denied, such as death and solid walls.</p><h3>The Beauty and the Flame (2008)</h3>  <p>This essay explores the mystical allure of fire.</p><p>Fire and light take in various meanings across societies.  Celestial fire and light was the divine essence to medieval people.  Fire was knowledge and craft to the ancient Greeks, as illustrated in the myth of Hephaestos.  Terrestrial fire was hell to the ancients.  Fire was transformation to alchemists.  Fire consumes, reveals and is an agent of creation as well as destruction.  Ekpyrosis: everything comes from fire and will return to fire, as in the phrase: Ashes to ashes, dust to dust.</p><h3>Treasure Hunting (2009, 2011)</h3>  <p>European reliquaries are filled with hidden beauties.  It is faith that makes the relic, not secular truth of its origins, proven by science or otherwise.  The political agendas of the faithful are revealed through the stories of these relics.</p><p>There is a part of <i><a target=\"_blank\" href=\"http://amzn.com/0156029065\">Baudolino</a></i> that deals with the manufacture of relics.</p><h3>Fermented Delights (2008)</h3>  <p>Piero Camporesi loved words; the more rare and forgotten the better.  He also loved food and putrefaction and lists.</p><h3>No Embryos in Paradise (2008)</h3>  <p>When does human life begins?  St. Thomas Aquinas tackled the problem based on when the soul enters the body to make a human being.  He had concepts of a vegetative soul for plants, a sensitive soul for animals, and a rational soul for humans.  The embryo acquires each of them in stages, each one corrupting and then augmenting the previous one, in a similar process to how nutrients are corrupted in the body before being incorporated into through metabolism.  Except St. Thomas Aquinas predates our scientific understanding of chemistry, biology, and metabolism.</p><h3>Hugo, H&eacute;las!: The Poetics of Excess</h3>  <p>Victor Hugo's novel are not about a specific character, or about a specifc event, for that matter.  Instead, he attempts to create an impression in the reader's mind, through massive excesses and seemingly infinite lists, similar to how Beethoven would weave a tapestry of sounds and melodies in his symphonies to convey a feeling.  Ultimately, Hugo's characters are the forces of Fate and Destiny themselves.</p><h3>Censorship and Silence (2009)</h3>  <p>You can censor information by suppressing it, or by burying it with noise.  For example, news channels will distract the viewers with an unending stream of banal stories so they do not pay attention to the serious corruption stories.  Advertisement is another case where advertisers pile meaningless noises one on top of the other; what matters is that you advertise your product, not so much what you actually say about it.</p><p>We are so distracted by noise that we cannot think for ourselves anymore.  We should therefore be mindful of silence as a way to promote better thinking.</p><h3>Imaginary Astronomies (2001, 2002)</h3>  <p>People have used their imagination to fill gaps in their knowledge: about the heavens, about the earth, etc.  They've also forged histories about them to foster political agendas.  Prester John's letter helped spur European expansion into Asia and Africa.</p><blockquote>  <p>Remember the greatness of those imaginary geographies and astronomies, and those errors that often bore fruit.</p><footer>page 161</footer></blockquote>  <h3>Living by Proverbs (2007)</h3>  <p>An absurd piece of writing.  What if we took every silly proverb literally?  It makes absolutely no sense, which is the point, and is only barely entertaining.  Many of the proverbs seem to come from English, so I'm curious what the original text in Italian must have been like.  I'm sure some of these proverbs might have existed in Latin and made their way into European languages.  But all of them?</p><h3>I Am Edmond Dant&egrave;s (2008)</h3>  <p>Anagnorisis is a frequently used literary device that worked well for episodic feuilleton novels.  It can be overused at times, but is still very powerful.  Anagnorisis is when the reader enjoys deceiving the characters.  Like Odysseus coming back to Ithaca and tricking the suitors.  Double anagnorisis is when the author deceives the reader, such that the reader was not aware of the real identity of the character.  I can think of the White Wizard being revealed as Gandalf in <i>The Lord of the Rings</i> as an example, and extreme cases in movies could be <i>Fight Club</i> and <i>The Sixth Sense</i>.  Anagnorisis is also frequently used in manga and anime, other serialized forms of story telling.</p><h3>Ulysses: That's All We Needed... (2009)</h3>  <p>James Joyce, as seen by Italian commentators in the fascist years before World War II.  They criticize him for not being true to what they considered the formal form of the novel, of not being nationalistic enough, and accuse him of being a Jew.  All typical characterizations of the <i>enemy</i>.</p><h3>Why the Island Is Never Found (2011)</h3>  <p>Lost islands have long held people's fascination.  For a long time, difficulty in determining longitude meant that islands were found then lost, misidentified, confused.  This essay ties to the Eco's novel <i><a target=\"_blank\" href=\"http://amzn.com/0156030373\">The Island of the Day Before</a></i>.</p><h3>Thoughts on WikiLeaks (2010)</h3>  <p>WikiLeaks showed that all Secret Services only repeat information in the public domain.  Conspirators only believe what they already know.</p>","titles":[{"link":"http://amzn.com/0547640978","title":"Inventing the Enemy and Other Occasional Writings"},{"title":"<i>Costruire il nemico e altri scritti occasionali</i>","link":null}],"publisher":"Houghton Mifflin Harcourt","start":"2014-06-28","acquired":"2013-07-11"},{"years":["2009"],"name":"Une_rencontre","stop":"2014-06-16","authors":["Milan Kundera"],"acquired":"2013-07-04","start":"2014-04-16","body":"<p>Kundera's latest book is a collection of short texts where he develops his understanding of Modernism, across the arts in general, and in novels in particular.  The result is a rather eclectic but interesting peek into Modernism and some of its less famous proponents.</p><p>Each section as short enough that I could read each one in a single sitting and write down my notes immediately after.</p><h3>The Painter's Brutal Gesture: On Francis Bacon</h3>  <p>Early and mainstream modernists gained followers who helped define their vision.  Francis Bacon, being the last of the modernist painters, does not have such a group that imposes a form.  He is free to draw inspiration from all of Modernism.  His paintings cut to the core of their subject, without any additional layers. He shows life as an accident, without any higher purpose.</p><h3>Novels, Existential Soundings</h3>  <p>Different novels shed different lights on separate aspects of the human experience: laughter (<i>The Idiot</i>), vanity, sex (Philip Roth), individuality (as a nine year old), idylls (<i>Tworki</i>), living in the present with imperfect memories, life as a continuation through generations (<i>One Hundred Years of Solitude</i>).  Novels help us explore the human condition.</p><h3>Blacklists, or Divertimento in Homage to Anatole France</h3>  <p>Each of us only knows a portion of a given artist's works and we form our opinion based on that partial knowledge.  Therefore, it is very easy for two persons to have completely different interpretations and appreciations for a same artist.</p><p>The setting of a novel can mask its message if the reader closely identifies with that setting (e.g. a Frenchman and the French Revolution).  Fleeting opinions of a blacklisted artist is all based on incomplete information.</p><h3>The Dream of Total Heritage</h3>  <p>As an art form develops, its possibilities narrow down as it gets more and more precisely defined.  Then, an artist comes along who breaks with tradition and reconnects with the original, total possibility of the art.  Witness Rabelais, Beethoven, Xenakis, and Fuentes.  Either they claim ownership of their entire art, or else they place themselves outside of it, above it.</p><h3>Beautiful Like a Multiple Encounter</h3>  <p>Kundera comments on Modernist literature of Martinique and how it relates to prior developments in the art of the novel.  It not only expands on European Modernist tendencies, but taps into local oral traditions the way the early European novel developed from its earlier oral tradition too.  It is not only Caribbean meets Europe, but early novel meets modern novel.</p><h3>Elsewhere</h3>  <p>Exile can be freeing for an artist, who is no longer bound by obligations to his home nation, and not bound by their host nation either.  The artist's only loyalty has to be to their art, and nothing else.  This can cause breaches in friendships when expectations start to diverge.</p><p>As a Canadian and Qu&eacute;bec expatriate living in the United States, this part resonated very strongly with me.  I am proud of my heritage, but I do not feel beholden to it either.</p><h3>My First Love</h3>  <p>Kundera grew up in the legacy of Janacek and better understands why he belongs with Modernist composers, and not romantic nationalists.  Janacek was a late bloomer and has a unique understanding of how nostalgia is how music expresses old age.  This is in contrast to how old age is usually represented in visual arts.  Janacek's isolation made it difficult of him to belong to an art movement and be recognized.</p><h3>Forgetting Sch&ouml;nberg</h3>  <p>Kundera deplores the loss of art for art's sake in Europe of the 20<sup>th</sup> Century. Makers of films (Fellini), photographs (Brecht), music (Sch&ouml;nberg), novels, poetry are being analyzed with a clinical coldness for their intrinsic faults, not what they bring to their art and to the human experience.</p><h3>The Skin: Malaparte's Archi-Novel</h3>  <p>Malaparte gives a new form to the novel. He uses it to express his view of the new Europe that emerged from the ashes of World War II.  His novels are less formal than 19<sup>th</sup> Century novels, more realist than surrealists of the early 20<sup>th</sup> Century. They capture the end of Europe, destroyed internally by Germans and finished by <i>liberating</i> Americans.</p>","publisher":"Gallimard","titles":[{"title":"Une rencontre","link":"http://www.amazon.ca/dp/2070122840"},{"link":"http://amzn.com/0061894435","title":"Encounter"}]},{"publisher":"Twelve (Hachette)","titles":[{"title":"Mortality","link":"http://amzn.com/1455502758"}],"body":"<p>Hitchens told his editor he would write about anything except sports.  So when he was diagnosed with cancer, he wrote about it.  And as he approached his own end, he kept on writing.  He takes us on an intimate ride along as he explores his attitude towards death.</p><p>Early on, when death is but a shadow on the distant horizon, Hitchens is more outward-facing.  He deals with religion and people wishing him well (and sometimes not).  As the book and his cancer progress, he sheds externalities and slowly gets more personal.</p><p>Breakdown by chapter:</p><ol><li>Diagnosis, dealing with the news, side effects of therapy.</li><li>People express their religious sentiments.  He'll have none of it.</li><li>The medical establishment tries everything to fight the disease.  More false hopes.</li><li>People's euphemisms to avoid talking about death.</li><li>Losing his voice strikes <i>really</i> close to home.  Voice and expression are at the core of existence.</li><li>How people choose to die.  How what almost kills him is <b>not</b> making him stronger.  Starts to yearn for the end.</li><li>Personal observations on pain and fear, in the face of torture ... or medical procedures.</li><li>Unfinished thoughts.  Fitting that at the end, even his mind comes apart.</li></ol><p>Hitchens mentions journalist John Diamond who also wrote a regular column about his experience with cancer, up to his death.  He mentions how his story \"lacked compactness toward the end...\"  He didn't fall into the same trap.  The book is concise and to the point, a quick read that goes straight to the point.</p><p>On 2014-01-26, I came upon this New York Times article where Dr. Paul Kalanithi recounts <a target=\"_blank\" href=\"http://nyti.ms/1eXxdlj\">when he was diagnosed with lung cancer</a>.  He talks about the patient-doctor relationship and how focusing too much on survival rates can make you miss the important things in life.  I can't help but wonder at the timing coincidence of seeing this article just as I finished reading Mortality.  Is it that lots of people are currently contemplating their own mortality these days?  Or is it me who is more sensitized to it because I just read this book?</p><p>On 2015-02-19, I came upon another New York Times article where <a target=\"_blank\" href=\"http://nyti.ms/17u5LNP\">Dr. Oliver Sacks talks about his cancer diagnosis</a>.  I find it interesting that at this point, he is looking back upon his life.  Hitchens was more focused on the present and the future, the pains and the moments to come.</p>","start":"2014-01-12","acquired":"2013-07-11","authors":["Christopher Hitchens"],"stop":"2014-01-16","name":"Mortality","years":["2012"]},{"name":"The_Prague_Cemetery","authors":["Umberto Eco"],"stop":"2014-01-05","years":["2010"],"start":"2013-01-21","publisher":"Houghton Mifflin Harcourt","titles":[{"link":"http://amzn.com/0547577532","title":"The Prague Cemetery"},{"title":"<i>Il cimitero di Praga</i>","link":null}],"body":"<p>Governments, especially 18<sup>th</sup> Century European governments, need an enemy to focus public discontent away from themselves.  Simonini, the main character, provides forged documents to assist one faction or the other in their quest to hold on to power, as he lives through the Italian unification and later the numerous troubles of Paris in that century.  A product of his age, he is a misanthrope, a misogynist, an anti-semite, sometimes an anarchist, sometimes pretending to be a freemason.  The novel wants to be a historical novel, where the background and much of the action is grounded in actual history.  Simonini is a thread that anchors the story through those tumultuous times and gives us a unique point of view of all these secret services, secret societies, and charlatans.  This allows Eco to weave Garibaldi, the Franco-Prussian War, the Paris Commune, and even the Dreyfus Affair into the story, setting the stage for 20<sup>th</sup> Century events to come.</p><p>It took me a whole year to get through this novel, not because of it is particularly dense (it is actually quite light for an Eco novel), but simply because the main character is so antipathetic.  Eco went to great lengths to make him as unlikeable as possible.  There is not one shred of humanity in him that the reader can associate with, not even the gourmet eating, which is lavishly described throughout.</p><h3>Diaries And Narrators</h3>  <p>There are all kinds of characters involved in manipulating history from the shadows.  Eco needs different narrators to help convey the principal archetypes.  Simonini is a forger, in it for the money.  Abb&eacute; Dalla Piccola is a manipulating priest, led by a grand plan, a more noble ambition.  To help transition between the two, there is an omniscient Narrator who can fill in as needed.  This Narrator can also serve to humanize them, so that they can succumb to human frailties, such as confusion or willful forgetfulness or fatigue.</p><h3>Unsatisfying, Gratuitous Sex Scene</h3>  <p>As in <i><a target=\"_blank\" href=\"http://amzn.com/0544176561\">The Name of the Rose</a></i>, we get a brief sex scene between an inexperienced male and a lusting female.  We share the point of view of the male, who is so overwhelmed that he gets utterly confused.  It is awkward and totally misses on the sensuality of the moment.  I could have done without.</p><h3>Open Ended</h3>  <p>Eco uses an open ended narrative device to reinforce the role of the reader in constructing the story for themselves.</p><p>* * * Spoiler Alert * * *</p><p>Did the bomb explode?  Did Simonini die in the explosion?  Did Gaviali set him up to extract revenge?  Was it Rachkovsky cleaning up loose ends and getting rid of a potential witness, just as Simonini had done numerous times?  Or maybe Simonini survived, somehow, and realizing the danger he is in, has gone into hiding?  It is up to the reader to finish the story for themselves.</p><h3>Quotes</h3>  <blockquote>  <p>Nothing is more original than something that's already been published.</p><footer>somewhere between pages 331-378</footer></blockquote>  <p>What he means is that when trying to convince people that a fake document is genuine, it helps if the target audience is already familiar with the material.  Previously published material will strike a resonance in the reader's mind and prime them to treat the new material as authentic.  Especially if the material was published some time ago and the audience's recollection is a little fuzzy.  It will <i>feel</i> right since it matches prior recollections.  Most people won't go through the trouble of double checking.</p><blockquote>  <p>Most of those who join secret societies are opportunists who seek to make their own way and have no worthy purposes.</p><footer>page 421</footer></blockquote>  <p>This is said in the context of jews-are-infiltrating-secret-societies-as-part-of-their-plan-to-take-over-the-world.  What it means is that members of secret societies are looking for a sense of purpose, which the leaders can provide and then use to manipulate the group and get them to support the leaders' agenda, sometimes against their own best interest.  Eco's character makes that statement about secret society membership, but I think it can easily be applied to most organizations.</p>","acquired":"2012-12-25"},{"name":"Good_Boss_Bad_Boss","authors":["Robert I. Sutton"],"stop":"2012-12-06","years":["2010","2012"],"start":"2012-11-14","publisher":"Business Plus","titles":[{"link":"http://amzn.com/0446556076","title":"Good Boss, Bad Boss"}],"body":"<p>I liked <a href=\"#The_No_Asshole_Rule\">The No Asshole Rule</a>, so I thought I'd give this one a try too.  Sutton bills the book as a follow-up to <i>The No Asshole Rule</i>, but with more focus on good management practices and less on the bad.</p><p>The key takeaway is that the job of a boss seems engineered to breed assholes.  Bosses suffer from a double bias: they overestimate their own abilities and they cannot see how they are perceived by others.  This leads people in boss positions to make poor decisions that everyone will notice but themselves.  A good boss is more self-aware to notice when they misstep, and is more graceful about accepting their failings and acting on them.  They surround themselves with people who will keep them grounded.</p><p>It's a nice coincidence that I'm reading this book just as Steven Spielberg's movie <i>Lincoln</i> is in theaters.  This books discusses how Lincoln appointed some of his rivals to his cabinet because their honesty would result in better decision-making.  This is all documented in the book <i>Team of Rivals</i> by Doris Kearns, on which the movie is based.</p><p>The rest of the book has a number of tips and tricks to help bosses deal with this double bias trap.</p><ul><li>Use repetitive and concrete advice (and keep repeating it).  This is the basis for the KISS principle.  Focus on executing the steps and the results will take care of themselves.  This reminds me of kyudo (Japanese archery) where the focus is on form rather than results, to the point where hitting the target is not really important.</li><li>David Kelly of IDEO talks about the balance between the needs of the business (performance) and the needs of the subordinates (humanity).</li><li>More David Kelly: confidence breeds more confidence.  Act confident and it will come to you.  This reminded me of a part of the book <i>Starship Troopers</i> where the main protagonist is told during officer training that officers must always look like they have all the answers, even when they do not.</li><li>Stand-up meetings to use people's time efficiently and respectfully.  He references a paper by Allen C. Bluedorn on \"The Effects of Stand-Up and Sit-Down Meeting Formats on Meeting Outcomes.\"  He does not mention agile software development.</li><li>Asshole Tax: charging more when having to deal with assholes.  Assholes are costly in churn and lost productivity / innovation.</li><li>Embarrassment and pride can be great motivators.  Imagine your child were following you around.</li><li>One manager took subordinates to a hospice to put evaluations into perspective.</li><li>Acid tests for good boss: 1) Would people work with the boss again? 2) Do they know what it's like working for them?</li><li>Favor small teams.  Complexity increases exponentially with team size.</li></ul><p>The book has a large number of anecdotes, taken from an extensive bibliography.  You cannot deny that it draws from serious scholarship and lots of excellent research.  But I was still left feeling like there wasn't a comprehensive theory of management behind it.  Just my somewhat uninformed opinion, here.</p><p>Sutton teaches at Stanford and lives in the San Francisco Bay Area.  It is only normal that there would be some references to some things American.</p><ul><li>Alice Waters and her restaurant Chez Panisse.</li><li>Management firm Bain, brought to general attention by presidential candidate Mitt Romney.</li><li>Tommy Lasorda once said managing was like holding a bird: too tight and you kill it, too light and it flies away.  I first heard it from my kendo teacher in Montr&eacute;al.  I don't know if he got it from Lasorda or if they both pick it from some other, common source.</li><li>Sutton brings up the performance evaluations and feedback at Google.  He advocates rewarding collective behavior over individual performance.  From my memories of Google, their process does not reward collective action enough.</li><li>The rescued Chilean miners in 2010-10.</li><li>Steve Jobs: too brilliant to be imitated.</li><li>The Hillsborough home invasion on 2008-11-25 where mother Loan Kim Nguyen was able to save her two young children but died herself.</li></ul><p>Bosses need to promote performance AND humanity.  Some bosses may owe their success to circumstances more than to their skills (I'm thinking of the likes of Larry Page and Sergei Brin, who are brilliant but also owe a large part of their success to very lucky timing).  Others owe their success to their constant dedication to work and team (Mitchell Baker of Mozilla, Ed Catmull of Pixar).</p>","acquired":"2012-04-26"},{"years":["2004","2002"],"authors":["Umberto Eco"],"stop":"2012-09-19","name":"On_Literature","acquired":"2012","titles":[{"title":"On Literature","link":"http://amzn.com/0156032392"},{"link":null,"title":"<i>Sulla Letteratura</i>"}],"publisher":"Harcourt","body":"<p>The book is a collection of essays written by Umberto Eco for various conferences.</p><h3>On Some Functions of Literature (2000)</h3>  <p><i>Literature keeps language alive.</i>  It creates a shared body of stories and characters.  Different authors each given them their own spin, but their core is part of the collective consciousness.</p><h3>A Reading of the <i>Paradiso</i> (2000)</h3>  <p><i>Paradiso</i> is about light, which was an important concept to medieval readers and thinkers.  Cathedrals are all about different kinds of light.  We don't pay as much attention to the quality light anymore; and it lessens our ability to truly appreciate the text as much as it was when it was written.</p><h3>On the Style of <i>The Communist Manifesto</i> (1998)</h3>  <p>The format and structure of the Manifesto is a great sample of packing a lot of power in a concise space.  It has all the drama and plot twists of the best narratives.</p><h3>The Mists of the Valois (1999)</h3>  <p>How the imperfect tense can lead to enough fuzziness about the action to leave the reader in perpetual mists and create an atmosphere more felt than any feelings explicitly expressed in words.  This effect can then be reinforced and amplified by various narrative techniques.</p><h3>Wilde: Paradox and Aphorism (2000)</h3>  <p>An aphorism is a maxim that is witty and which appears to be true.  It expresses something commonplace.  A paradox is a maxim that is witty and appears false at first glance, but reveals a deeper truth upon further examination.  To tell them apart, reversing an aphorism produces something that still makes sense, whereas reversing a paradox yields nonsense.</p><h3>A Portrait of the Artist as Bachelor (1991)</h3>  <p>How James Joyce's style and literary pursuits were already well established by the time he graduated from college.</p><h3>Between La Mancha and Babel (1997)</h3>  <p>How Joyce and Borges try to re-invent language, each in their own way.  Joyce by looking at all permutations of symbols.  Borges by looking at all permutations of ideas.</p><p>Another interesting piece is how in <i>Don Quixote</i>, the story starts when the main character leaves a library to discover the world outside.  In one of Borges' novels, the main character enters a Library of Babel to escape from the world outside and experience reality through books.</p><h3>Borges and My Anxiety of Influence</h3>  <p>Sometimes, an author borrows an idea from another author.  Sometimes, an author develops an idea from the general context, not knowing that another author has also expressed the same idea too.  Some times, an author develops an idea from the general context, not knowing that another author was directly responsible for putting it there.</p><h3>On Camporesi: Blood, Body, Life (1995)</h3>  <p>Camporesi was a cultural anthropologist who studied texts for cultural artifacts, studying the underbelly of civilization.</p><h3>On Symbolism (1994)</h3>  <p>Symbolism as understood by the scholastic philosophers.  There is the perceived world of phenomena and the world of ideals hiding behind it.  In this way, everything is a symbol that stands for an ideal which we cannot perceive directly.</p><h3>On Style (1995)</h3>  <p>Style is how a work of art is put together.  Eco identifies three ways of studying style.  In a <i>review</i>, the writer tells the reader about a book the reader has not yet read and impose the writer's judgment.  A <i>history of literature</i> discusses works that the reader already knows.  In both cases, the writer can do <i>artifex additus artifici</i> (an artist writing about an artist) where he explains how he felt as he produced the work of art.  Or he can do <i>philosophus additus artifici</i> (a philosopher writing about an artist) where he explains why a given work of art is beautiful.  The third way of studying style is the <i>semiotic reading</i> in which the writer shows how the work of art produces pleasure, rather then prescribing what gives pleasure.</p><h3><i>Les S&eacute;maphores sous la Pluie</i> (1996)</h3>  <p>How a writer relies on some common images or experiences shared with the reader.  If the reader does not share a given image or experience, part of what the writer was trying to communicate will get deformed or lost.</p><h3>The Flaws in the Form</h3>  <p>Elements in the structure of a text.  If the work of art arises from the whole of the composition and how the parts all fit together, then which parts essential?  Does it mean that everything else just fodder?  Will the art still arise if we remove those non-essential parts.  And what about stopgaps, small particles that enhance the flow of the work and assure its stability?</p><h3>Intertextual Irony and Levels of Reading (1999)</h3>  <p>Draws heavily on Eco's <i>Reflections on \"The Name of the Rose.\"</i>  Eco is a big fan of layering multiple levels of meaning in his prose.  The reader can choose which level they latch on when interpreting a text.  Not all readers can access all levels of a text.  Some of them require specific knowledge to fully grasp them.  But missing out on one level should not keep the reader from appreciating others.</p><h3>The <i>Poetics</i> and Us (1990)</h3>  <p>The influence of Aristotle's <i>Poetics</i>.  Notions of <i>pragma</i> (action) and <i>mythos</i> (plot) and how they apply to the many forms of story-telling.</p><h3>The American Myth in Three Anti-American Generations (1980)</h3>  <p>Disregarding American politics, American literature of the late 19th and early 20th Century appealed to European intellectuals.  The American it portrayed was open and free and devoid of all the barriers and structures that were so limiting on the Old World.</p><h3>The Power of Falsehood (1994)</h3>  <p>How lies and fakes have played pivotal roles in the history of the Western World.  The Donation of Constantin solidified the power of the Catholic Church in Rome and was the basis of the power of the Papacy from the fall of Rome to modern times.  The letter of Prester John motivated the West's exploration and expansion into the East.</p><h3>How I Write (1996)</h3>  <p>Eco's own quirky approach to writing his novels.  It focuses on <i><a target=\"_blank\" href=\"http://amzn.com/0544176561\">The Name of the Rose</a></i>, <i><a target=\"_blank\" href=\"http://amzn.com/0151327653\">Foucault's Pendulum</a></i>, and <i><a target=\"_blank\" href=\"http://amzn.com/0156030373\">The Island of the Day Before</a></i>, with some bits about <i><a target=\"_blank\" href=\"http://amzn.com/0156029065\">Baudolino</a></i>.  He describes parts that were essential to him which I do not remember at all.  Makes me want to re-read all his novels.  Right now.</p>","start":"2012-08-27"},{"acquired":"2012-04-26","body":"<p>From the reviews, this books sounds a bit controversial and rubbing against the accepted wisdom.  To be read with a dose of critical judgement.  I like to challenge my assumptions and consider alternatives, but that doesn't automatically make them right.</p><p>The book's premise is that humans are not naturally monogamous.  Monogamy was introduced when we discovered agriculture.  Prior to that, our hunter-forager ancestors had no notion of property and shared everything.</p><p>In The Naked Ape, Desmond Morris specifically ignored primitive societies.  In order to study humans, he focuses on their dominant representation.  In his view, primitive societies must have had some defect or other that limited their expansion.  Not knowing what these defect might be, he abstains from including them so he does not taint his data.</p><p>The authors of Sex at Dawn take a different approach.  To them, these primitive hunter-foragers can give us a glimpse of what our ancestors might have been like.  They complement their approach by looking at our closest relatives in the animal kingdom: chimps but even more so bonobos.  The picture that emerges is quite different from the mainstream vision we inherited from Hobbes in 1651, where human life is <em>solitary, poor, nasty, brutish, and short</em>, and Malthus in 1798 where overpopulation and famine are unavoidable.  Instead, they point at hunter-forager societies that live in equilibrium with their environment, share resources, and have a mostly peaceful existence.</p><p>By combining data on bonobos from biologists, on primitive societies from anthropologists, and on modern sexual behavior from psychologists, they raise the possibility that homo sapiens spent most of their evolutionary history in small tightly knit groups where both men and women had multiple sexual partners and no hard-fixed patterns.  They shared everything, even of themselves, and child rearing too.  When we discovered agriculture and property became important, this is when we tried to force ourselves in monogamous relationships and the nuclear family model.  The tension between the demands of monogamy and our looser evolutionary attitude towards sex would be at the root of all our contemporary problems.</p><p>They don't go as far as recommending that we all go and start sleeping around.  But understanding what drives our nature, refined through hundreds of thousands of years of evolution, can help us be honest about ourselves and learn to live without the guilt.</p><p>All the material in the book made a lot of sense and much of it deserves further looking into.  While they suspect bias in many other authors, it is not clear that they didn't have their own bias too.  Some reactionary backlash is to be expected.  I didn't care much for their writing style.  All the snide sarcastic remarks and juvenile retorts made it look like is was written by a pair of teenagers.  As if!</p><p>And, I learned a new word: <a target=\"_blank\" href=\"https://www.google.com/search?q=define%3Aprurient\">prurient</a>.  :-)</p><p>On 2015-05-19, I came upon this article in The Guardian where <a target=\"_blank\" href=\"http://gu.com/p/4926j/sbl\">Mark Dyble of University College London published a study on sexual equality</a> that reinforces many of the conclusions of Ryan and Jeth&aacute;.  The Guardian article highlights many points from both the sex contract and the fierce egalitarianism points of view.  The article was a good summary of how the debate has been going over the past 200 years without picking a side.</p>","titles":[{"link":"http://amzn.com/0061707805","title":"Sex at Dawn"}],"publisher":"Harper Collins","start":"2012-08-17","years":["2010"],"stop":"2012-08-26","authors":["Christopher Ryan","Cacilda Jeth&aacute;"],"name":"Sex_at_Dawn"},{"acquired":"2012-04-26","start":"2012-05-03","titles":[{"link":"http://amzn.com/0670023469","title":"Pakistan on the Brink: The Future of America, Pakistan, and Afghanistan"}],"publisher":"Viking","body":"<p>I really appreciated his two other books, Taliban and <a href=\"#Descent_into_Chaos\">Descent into Chaos</a>, for their deep knowledge of the issues at stake in Afghanistan and Central Asia.  I was looking forward to this update on things are evolving.</p><p>Things are not going well in <i>AfPak</i>.  Since American troops will leave Afghanistan by 2014, everybody is pretty much waiting for them to have left before they make their move.  The Afghan government is feeling isolated and abandoned.  Pakistan wants to play a major role in shaping the future of Afghanistan, which it sees as a strategic component of its strategy regarding India, but it also has to deal with its home brand of islamist fundamentalists.  All the other neighbors are taking a wait-and-see attitude.  America is doing its best to make a dignified exit.</p><p>The last pages of the book mention the accidental killing of 26 Pakistani soldiers in a NATO air strike on 2011-11-26.  This prompted Pakistan to close to supply routes into Afghanistan.  On 2012-05-21, the news mentioned a NATO summit where they were talking about these closed supply routes.  Six months after the incident, the issue is still not resolved.</p><p>On 2012-05-23, <a target=\"_blank\" href=\"http://www.google.com/hostednews/ap/article/ALeqM5jrph4TaxnPQbRXQyE-J630WjOM-Q?docId=4785f8c699964efea7e1288c82f61b05\">Pakistan convicted the doctor who helped the CIA track down Osama bin Laden</a>.  Just like Ahmed Rashid mentions in the book, Pakistani officials are more concerned with the breach of their sovereignty by the US raid to kill bin Laden than with the fact he was being given shelter in Pakistan.  On 2012-05-24, the US <a target=\"_blank\" href=\"http://www.google.com/hostednews/ap/article/ALeqM5g1BkaLuKXvE1gWEJSjTRW2bZsezQ?docId=b35bff82804641bba498bf7aaffcac44\">suspended $33 million in aid to Pakistan</a> in retaliation, and on 2012-05-25, <a target=\"_blank\" href=\"http://timesofindia.indiatimes.com/world/us/US-lawmakers-call-Pakistan-terrorist-state-schizophrenic-ally/articleshow/13492994.cms\">US lawmakers called Pakistan \"terrorist state\", \"schizophrenic ally\"</a>.</p><p>I'm afraid Rashid's next book on the region, in a few years, after the American withdrawal, will be quite depressing.</p>","years":["2012"],"name":"Pakistan_on_the_Brink","authors":["Ahmed Rashid"],"stop":"2012-05-18"},{"years":["2008"],"stop":"2012-04-23","authors":["Suzanne Collins"],"name":"The_Hunger_Games","acquired":null,"body":"<p>The movie was pleasant enough and a friend recommended it, saying it was in line with other books I've read.  The movie missed the boat, though, on its depiction of running a reality show.  The book was written in 2008 and the movie was made in 2011, when we have clear patterns of how these shows engage and entertain the audience to drive advertisers, from Survivor to American Idol.  There are stages, constants recaps, and many engage the entire viewing audience using various voting schemes.  All that was missing and instead we got a very simplistic show driven by a small elite of Sponsors, with most of the viewing audience left out.  I understand that the powers-that-be don't care about the people in the districts, but they should at least get to everyone in the Capitol.</p><p>I was happy to find that the novel does a much better job of portraying the entertainment aspect of the Hunger Games that the movie did.  While the book is told entirely from Katniss' point of view, we get glimpses of when she used to watch the Games and how she imagines things are playing out as she participates in them.  Here, the entire audience of Panem gets to participate, though it is clear that residents of the various districts are limited by their economic situation.</p><p>I found the beginning annoying.  Katniss, the main character, goes to great length to over dramatize what should be mundane experiences, such as eating a blackberry on a lazy morning.  If there had been more context to make the moment special and to justify being over-sensitive, it might have worked.  But that moment is a quiet moment but otherwise ordinary moment and did not deserve that level of intimate details.</p><p>As the situation gets worse for the main characters, things start to improve from a literary perspective.  Just a little further, a passage really stands out for me, on page 40, as Katniss is coming to grips with having to fight others to the death (emphasis is mine):</p><blockquote>  <p>\"Katniss, it's just hunting.  You're the best hunter I know,\" says Gale.</p><p>\"It's not just hunting.  They're armed.  They think,\" I say.</p><p>\"So do you.  And you've had more practice.  Real practice,\" he says.  \"You know how to kill.\"</p><p>\"Not people,\" I say.</p><p>\"How different can it be, really?\" says Gale grimly.</p><p>The awful thing is that <i>if I can forget they're people, it will be no different at all</i>.</p></blockquote>  <p>This passage talks to how people can do truly horrible things to other people if they just dehumanize them first.  As soon as we don't perceive the other as a fellow human being, we can excuse anything we do to them.  This passage is clear and concise, without any superfluous sappy over-sensitivity.</p><p>And there is another passage on page 65:</p><blockquote>  <p>What must it be like, I wonder, to live in a world where food appear at the press of a button?  How would I spend the hours I now commit to combing the woods for sustenance if it were so easy to come by?.</p></blockquote>  <p>The trick here is that while Katniss can hardly imagine a world of plenty, the author and her contemporary middle class audience do live in such a world.  It is difficult to be any clearer: the reader is not a sympathetic resident of District 12, but a citizen of the Capitol.</p><p>Unfortunately, these small glimpses don't get developed much further.  Katniss is much too busy trying to stay alive to ponder these questions at great length.</p><p>The action parts are well done.  I am not a hunter, so I cannot speak to the veracity of her experiences in the arena.  But I wonder if the author has done any hunting herself, or else how she researched those aspects of the book.</p><p>By the time the crisis is resolved, Katniss has become overly sappy again.  Her character has grown a bit, but there was a lot more potential there.  Maybe the sequels will give her time to internalize her experiences.</p>","publisher":"Scholastic","titles":[{"link":"http://amzn.com/0439023483","title":"The Hunger Games"}],"start":"2012-04-17"},{"years":["2011"],"name":"Micro_A_Novel","authors":["Michael Crichton","Richard Preston"],"stop":"2012-04-11","acquired":"2011","start":"2012-04-05","publisher":"Harper","titles":[{"link":"http://amzn.com/0060873027","title":"Micro: A Novel"}],"body":"<p>I received this book as a Christmas present.  I've liked previous Michael Crichton novels, but they do tend to become formulaic.  Crichton was still working on this manuscript when he died and Preston finished it for publication.</p><p>I started it while vacationing in Waikiki, which is interesting since the action is set on O'ahu.</p><p>Crichton novels are pretty formulaic.  There is a team of experts.  They get in trouble because of technology run amok.  Not everyone makes it.  Anyone who has anything to do with money is automatically a psychopath.  The technologies change, the experts change, but the basic formula remains the same.</p><p>There are many facts that are well presented, so you learn a lot reading the book.  But Crichton tends to take fringe ideas and use them as central plot devices.  He expounds how these ideas are so revolutionary that they turn their field upside down.  There is a good reason why these ideas are so fringe.  And Crichton can be quite pedantic when he shows off how \"he gets it better than all the experts in that field.\"  This is why I stopped reading his novels after I had read <i>Timeline</i>.  (I still watched the movie, though.)</p><p><i>Micro</i> is a typical Crichton novel.  As someone else said: a kind of <i>Honey, I Shrunk the Kids</i> for adults.  The premise is mildly interesting.  The treatment is not really inspired.  The characters are not really likable.  The plot twists are not completely surprising or really inspired.  The novel has one really cool thing going for it: it is set on O'ahu.  I'm glad I read it <b>after</b> my trip to Waikiki so I could really dig the landmarks.</p>"},{"years":["2006","<i>1996</i>"],"name":"Silk","authors":["Alessandro Baricco"],"stop":"2011-10-25","acquired":"2009","start":"2011-10-21","publisher":"Vintage International","titles":[{"title":"Silk","link":"http://amzn.com/0307277976"},{"link":null,"title":"<i>Seta</i>"}],"body":"<p>I vaguely remember reading this book a long time ago, but I cannot recall who had recommended it.  I liked the movie adaption.</p><p>This short novel has amazing rhythm.  When the main character is in Europe, the prose is quick, light, with few details.  When he is in Japan, things slow down.  And when the <i>woman with the face of a girl</i> is present, time seems to stand still and he becomes hypersensitive to the slightest details.  The text is brilliant as much for what is said as for what is not said.  The reader is made to feel what Herv&eacute; Joncour is feeling.  In Europe, things are mundane and expected; they hardly need mentioning; they certainly don't deserved getting excited over them.  In Japan, everything is different, every detail counts;  Herv&eacute; Joncour bristles with anticipation.</p><p>And the transitions are marvelous little gems in their own rights.  I love how, when Herv&eacute; Joncour travels eastward, the descriptions have a familiar structure but with slight variations each time.  The return travels are more quickly dispatched, but still evolve ever so slightly as the novel progresses.  It's like listening to music by Philip Glass: the notes keep repeating themselves but the melody is slowly evolving and you can't help but wonder where it will lead you.</p><p>This sense of rhythm was completely lost in the movie, but it made up for it with beautiful imagery.  The book is an amazing read.</p>"},{"start":"2011-10-12","publisher":"Harcourt","titles":[{"title":"The Little Prince","link":"http://amzn.com/0156012197"},{"title":"<i>Le Petit Prince</i>","link":"http://www.amazon.ca/dp/0156013983"}],"body":"<p>Best book ever.</p><p>I bought an English translation for the kids, until they can read the original in French.  I'm reading it to Vincent as I try to get the rhythm right.  This translation is okay, but it's still a little awkward around the edges. <i>Little fellow</i> doesn't have the same familiar cuteness as the French <i>petit bonhomme</i>.  But it is to be expected that a translation will never be exactly like the original.</p><p>This book is about friendship and what's important in life and it is also about death and loss.  It tackles very deep issues with disarmingly simple language.  It is very modern in its approach by paring things down to the absolute essential but at the same time using poetic elements to convey strong emotions succinctly.</p><p>I don't know that the kids are old enough to fully grasp the emotions expressed in the book, or to go beyond the literal interpretation of its central message.  When I was a child, I didn't get the message either and it was only when I read it again, much later, as an adult, that I could seize its full impact.  I hope the same can happen to them; that they will appreciate the beautiful, simple story and that they will want to revisit it when they're all grown up.</p><p>Curious factoid: my English translation states the original copyright as of 1943 whereas my French edition shows the copyright as of 1946.</p>","acquired":null,"name":"The_Little_Prince","authors":["Antoine de Saint-Exup&eacute;ry"],"stop":"2011-10-26","years":["2000","<i>1943</i>"]},{"body":"<p>I'm a big fan of the <code><a target=\"_blank\" href=\"http://xkcd.com/\">xkcd</a></code> webcomic and a friend got me this book.</p><p>You can read all the strips on the website, but the book had additional scribbles and notes in the margins that give us a glimpse into the mind of their author.  Very geeky, always accurate, and some are definitely NSFW.  Thoroughly enjoyable and a great gift for your favorite geek.</p><p>The author also added all kinds of little puzzles around the strips for the hard-core code breakers and problem solvers.  Some are really easy to decode, like the one where each letter is replaced with its position in the alphabet (A=01, B=02, etc.) or using <a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Braille\">Braille</a> patterns.  Others use 2D barcodes that require more work to crack.</p>","publisher":"Breadpig","titles":[{"title":"xkcd: volume 0","link":"http://amzn.com/0615314465"}],"start":"2011-02-10","acquired":"2011-01-14","stop":"2011-02-15","authors":["Randall Munroe"],"name":"xkcd_volume_0","years":["2009"]},{"acquired":null,"start":"2010-10-16","body":"<p>Christopher Hitchens references Bertrand Russell a lot.  This books seems to be a good place to start to understand Bertrand Russell.</p><p>The book is actually a collection of essays written by Russell over a 55 year period.  I will comment on each one separately.</p><h3>Why I Am Not a Christian (1927)</h3>  <p>Defines what is a Christian.  More than just living a good life, it implies a certain credo that begins with the existence of God.  The piece then debunks the various proofs for the existence of God that have been advanced by past philosophers.  He also highlights some of Christ's teachings that are not so popular among self-proclaimed Christians, such as \"turn the other cheek\" or \"judge not\" or \"give to the poor\", and others that are just plain destructive, such as the imminence of the Second Coming or Christ's conception of Hell has punishment for slights against his person.  Religion does not appeal to reason, we accept it wholesale because of the disproportionate influence of our early interactions with our parents as a young child.  \"Fear is the basis of the whole thing - fear of the mysterious, fear of defeat, fear of death.\"</p><h3>Has Religion Made Useful Contributions to Civilization? (1930)</h3>  <p>I got a good laugh at the opening statement: religion's only useful contributions have been fixing the calendar and predicting eclipses, and nothing else.  He then discusses religions as social phenomena, started by individuals with strong beliefs that are almost immediately rejected by the people who carry out their legacy.  Because the founders reveal one absolute and unchanging truth, their followers become \"opponents of all intellectual and moral progress.\"  The concept of sin is particularly dangerous because it gives people an excuse to indulge their sadistic urges at the expense of those who have transgressed the rules.  Especially when it comes to sex.</p><p>\"The objections to religion are of two sorts - intellectual and moral.\"  We need the openness of the scientific method to decide truths objectively.  Ancient morals were for crueler times that we have outgrown.  The focus on the individual soul, and that it is sufficient to <b>be</b> good instead of <b>doing</b> good set Western religions apart and in the end are detrimental to social life.</p><p>Unrighteousness is behavior that is disliked by the herd, which is therefore righteous by definition.  Such behavior must be punished.  \"The essence of the conception of righteousness, therefore, is to afford an outlet for sadism by cloaking cruelty as justice.\"</p><p>\"[...] the three human impulses embodied in religion are fear, conceit and hatred.  The purpose of religion [...] is to give an air of respectability to these passions [...].\"  These are more effectively controlled with proper, caring education than with dogma that is shrouded in mystery.</p><h3>What I Believe (1925)</h3>  <p>Russell sets forth his core convictions and his basis for living a good life.  He begins by grounding man in the physical world and expressing how science is in the process of finding out all there is to know about the physical world.  His views are somewhat outdated; whatever limits to scientific exploration were looming in 1925 have long been surpassed.  But the intent remains that even if the world is much more vast than expected, it is still finite; therefore its exploration will also be finite, even if very long.  Russell says how boring physical science will become when it is complete.  \"It is like climbing a high mountain and finding nothing at the top except a restaurant [...] equipped with wireless.\"  To me, \"wireless\" was wifi.  I'm sure it meant something else in 1925.  :-)</p><p>\"The good life is one inspired by love and guided by knowledge.\"  Love is a spectrum between \"delight\" (taking pleasure in the object of love) and \"benevolence\" (actually wanting something good for the object of love, like sympathy, but with an action component too).  Love is at its fullest when both delight and benevolence are maximized.  Knowledge is objective scientific knowledge.  When it follows the majority's desires, we call that knowledge \"ethical\", but this qualifier only applies to the relation to our desires, not to the knowledge when considered by itself.  \"Outside human desires there is no moral standard.\"</p><p>A society needs moral rules to reconcile conflicting desires among its members.  Criminal law attempts to punish transgressions, but it is more effective to find ways to align desires together in a win-win solution.  It is better for society to use scientific knowledge to measure and maximize overall happiness.  But religion too often is a set of arbitrary moral rules that only support the ruling class of society, at the expense of everyone else.  \"They condemn acts which do no harm and they condone acts which do great harm.\"  This leads Russell to a line of thought where [consensual] sex in the absence of children is a private matter.  Where children are concerned, he is adamant that measures must be taken to ensure their well-being.</p><p>Western religions have an individualistic perspective on how to lead a good life and often contain an element of catastrophic change or conversion.  To Russell, the good life can only be led in a good society.  It is necessary that it rest on more than mere conscience, but also include intelligence and health and a full social life.  In the social context, individuals need security and courage.</p><h3>Do We Survive Death? (1936)</h3>  <p>Our belief in an afterlife is motivated by fear: fear of death, fear of the unknown.</p><h3>Seems, Madam?  Nay, It Is (1899)</h3>  <p>Long-winded and pompous essay on the role of philosophy and whether we can explain reality purely in intellectual terms, separate from any desire for comfort or aesthetics.  In its defense, it is dated 1899, when Russell was still pretty young and his style hadn't quite emerged yet.</p><h3>A Free Man's Worship (1903)</h3>  <p>Religion tries to make us feel important by pretending that all of Creation was built with us as its central purpose.  Science shows us humanity's inconsequential place in the universe.  There is an interesting progression of the idea of worship.  \"The savage, [...] having in himself nothing that he respects more than power, [...] is willing to prostrate himself before his gods, without inquiring whether they are worthy of his worship.\"  \"The divine power and knowledge are paraded, but of the divine goodness there is no hint.\"</p><p>Since there is evil in the world and God is said to be omnipotent, then we must conclude that either God is evil or it is a creation of our intellect.  \"The worship of force [...] is itself a prostrate submission to evil.\"</p><p>\"To every man comes [...] the great renunciation.  [...] The world was not made for us.\"  First, we live in a world full of promise.  Then, there is a period of despair, where we abandon hopes that we realize are unattainable.  This act of renunciation can lead each one of us to wisdom where we can admire the world without the burden of desires.</p><h3>On Catholic and Protestant Skeptics (1928)</h3>  <p>Freethinkers coming from a Protestant background tend to be individualistic.  They seek to lead a good life for themselves.  Freethinkers coming from a Catholic background tend to be social.  They seek for society to lead a good life.</p><h3>Life in the Middle Ages (1925)</h3>  <p>We are guilty of idealizing the Middle Ages and always showing them contrasted with our current epoch.  \"Most people are ordinary people, concerned with their daily bread rather than with the great themes of which historians treat.\"</p><h3>The Fate of Thomas Paine (1935)</h3>  <p>Paine took democratic ideas and made them available to every intelligent working man.  He democratized democracy.  His contemporary (Washington, Robespierre, etc.) tried to limit democracy to a select elite; whereas Paine insisted that it be of the people, for the people.  He was crucial in promoting democratic ideals in England, America, and France, but in the end he died alone and destitute.  He fought against tyranny, which put his at odds with those revolutionaries who wanted to become tyrant in place of the tyrant.  \"He was consistently opposed to every form of cruelty, whether practiced by his own party or by his opponents.\"</p><h3>Nice People (1931)</h3>  <p>A nice tongue-in-cheek look at the hypocrisy of people who claim to be of good morals but in reality use moral rules to gratify their sadistic impulses.</p><h3>The New Generation (1930)</h3>  <p>Just as scientific knowledge is informing our views of the world, we should also apply it to raising the next generation.  Knowledge cures ignorance and makes actions more deliberate.  Education is no exception, where new methods informed by new knowledge can replace the old dogmatic methods.  Russell describes a social model where both men and women can pursue self-realization.  Higher standards of living ease the burden of child rearing, freeing people for to pursue other goals.  He also recommends letting children explore a lot more freely and let them go where their thirst for knowledge leads them.  Taboos create areas of artificial interest and in the end are self-defeating.</p><p>These ideas may seem self-evident to us now, but this was written in 1930.  The ideas that Russell rails against are the same ones that my parents were raised in.</p><h3>Our Sexual Ethics (1936)</h3>  <p>Modern life is evolving in directions that work against traditional, monogamous unions.  We need to adopt new ethics to ensure overall happiness.  What is detrimental to no one should not be proscribed.  Rather than promoting chastity unsuccessfully and forcing young men to turn to prostitutes, it would be far better to encourage experimentation between members of the same social class.  This can help everyone develop useful relationships that will help them grow into better citizens.</p><h3>Freedom and the Colleges (1940)</h3>  <p>On the subject of academic freedom, Russell contends that \"whether a man is a good mathematician, or physicist, or chemist, can only be judged by other mathematicians, physicists, or chemists.\"  Opponents to academic freedom would also want that such a person \"should have never expressed any opinion which controverts those of the holders of power.\"  He discusses the tyranny of the majority and how a healthy democracy must tolerate minorities.</p><p>There is an interesting argument regarding the tradition of freedom in the West.  If we consider that dissenting opinions must be tolerated, it means that we need institutions that can guard them against the holders of power.  The latter will have a strong desire to silence opposing opinions and there must be a force strong enough to counter them.  In the West, through the Middle Ages and the Renaissance, the Church and the State were constantly pitted against one another.  In Constantinople, the Church was subjugated to the State and therefore there never arose a spirit of freedom in Russia and other Orthodox countries, where the State went unchallenged, as in the West.</p><p><span class=\"newthought\">Note:</span> This belongs elsewhere, but I'm noting it here for now.  The majority opinion is self-reinforcing since each individual will naturally side with the majority to avoid being on the outside.  It follows that any hope of progress lies with the minority opinion.  If the majority is not kept in check and if it is allowed to successfully silence dissent, society will stagnate.</p>  <h3>Can Religion Cure Our Troubles? (1954)</h3>  <p>Russell wrote this article in 1954.  \"It is the question whether societies can practice a sufficient modicum of morality if they are not helped by dogmatic religion.\"  His answer is yes, and that some important virtues might be better found by rejecting religion than by embracing it, such as truthfulness and intellectual integrity.</p><p>Russell describes how some rules are purely a quirk of the religion and how others have a strong social basis.  While religion might have been useful to primitive societies in maintaining order, providing divine justice to cover the cases missed by the temporal one, this is less true in modern societies.  The problem with bundling moral rules with religion is that once we start doubting the religious claims, there is a risk that we will reject the entire moral code along with the religion.</p><h3>Religion and Morals (1952)</h3>  <p>Can religion make us happy and virtuous?  Russell argues that the virtue and happiness of believers is not really distinguishable from those of unbelievers.  \"There are various practical ways in which traditional morality interferes with what is socially desirable.\"  What we need is tolerance and intelligence.</p><h3>How Bertrand Russel Was Prevented from Teaching at The College of the City of New York</h3>  <p>A journalistic-like account, by editor Paul Edwards, of how Bertrand Russell was offered a position at The College of the City of New York and how influential people who opposed the appointment fought it in the public opinion.  They mounted a campaign to vilify Russell and any intellectual who would support him.  When that didn't work, they took the fight to the courts and, with the help of a hardly objective justice, managed to overturn the appointment.  This brought into question the notion of academic freedom and how a small minority can meddle in the affairs of others.  The board of directors of The College of the City of New York, the faculty, the student body, the parents of students, and the academic community at large broadly supported Russell's appointment.  Those opposed were religious groups with ties to influential people in New York.  The case in court was even brought up by woman fearful for her daughter, at a time when the college was for men only and her daughter would therefore not have been able to attend or be exposed to Russell.</p>","publisher":"Touchstone Book","titles":[{"link":"http://amzn.com/0671203231","title":"Why I Am Not a Christian"}],"years":["1957"],"name":"Why_I_Am_Not_a_Christian","stop":"2010-12-01","authors":["Bertrand Russell"]},{"start":"2010-09-06","body":"<p>Amazing pictures of objects in the Solar System, from the Nasa archives.  This is more of a picture book, really.  It's more like I'm lazily looking through it than actual reading.</p><p>I read about this book, and the <a target=\"_blank\" href=\"http://www.sites.si.edu/exhibitions/exhibits/beyond/main.htm\">matching exposition</a> in an article in the New York Times.  The pictures on the website were breath-taking, so I ordered the book.  Some of them are pictures of the Earth taken from orbit, kinda like those of <a target=\"_blank\" href=\"http://blog.summerwind.jp/special/astro_soichi/\">@Astro_Soichi</a> on Twitter.  Others are from other planets and moons, taken by space probes, some with false color.  The writer worked with astronomers and astroscientists to ensure his false coloring was as close as possible to reality.</p>","titles":[{"link":"http://amzn.com/0810995468","title":"Beyond: Visions of the Interplanetary Probes"}],"publisher":"Abrams","acquired":null,"name":"Beyond","stop":"2010-09-06","authors":["Michael Benson"],"years":["2009"]},{"acquired":null,"start":"2010-07-23","body":"<p>This is Hitchens' attempt at explaining Orwell's thoughts and to show how they are still relevant half a century later.</p><p>Hitchens opted for a thematic approach to Orwell rather than a chronological one.  He has separate chapters for imperialism, socialism, nationalism, etc.  Each time, Hitchens shows how Orwell's views were shaped by events in his life and how they evolved in his writings.  Hitchens also shows how other writers perceived these views, some are contemporaries of Orwell and others are writers who came well after him.  It was interesting when Hitchens had to disapprove of Salman Rushdie, whom he considers a close friend.  Hitchens was definitely less harsh about this friend than about the other detractors.</p><p>Personally, I am not very familiar with Orwell's life, so a timeline of major events and publications would have been useful.  I knew that <i><a href=\"#Animal_Farm\">Animal Farm</a></i> came before <i><a target=\"_blank\" href=\"http://amzn.com/0452284236\">Nineteen Eighty-Four</a></i>, but I hadn't realized that Orwell had died right after publishing the latter.</p><p><i>Imperialism</i>: About imperialism in general, and British imperialism in particular, Orwell wrote: \"the whole colonial 'racket' was corrupting to the British and degrading to the colonized.\"  This passage shows how he empathized with the common people and how he disliked those who are entrusted with power but turn out to be bullies.</p><p><i>Political Left</i>: About the Left, there is a hilarious quote where Orwell takes the contents of the Trotskist trials in Russia and changes the characters to English personalities.  In it, Churchill is trying to convert the entire British Empire to communism by getting postal workers to draw moustaches on postage stamps.  It's hilarious, until you realized such fabulations were taken as real in communist Russia.  Orwell's total distrust of totalitarianism did not win him many friends in socialist circles who espoused the Russian Socialist Revolution.  Many \"had set up to praise the Moscow regime and returned in disgust.\"  Orwell didn't need to go there; his experience in Catalonia during the Spanish Civil War had been enough for him to see the truth behind these regimes.  He had first-hand exposure to how history is written by the victors, which would culminate in the thought, in <i>Nineteen Eighty-Four</i>, that \"he who controls the present controls the past.\"</p><p><i>Political Right</i>: On the Right, Orwell's love of individualism and popular wisdom didn't win him too many friends either.  More exactly, they were quick to edit his thoughts, picking and choosing the bits that they liked and silencing those that they didn't agree with.  They reconstructed an ideal Orwell, one that would be best suited to their own points of view.  Orwell was a staunch anti-communist and was convinced that Socialism would inevitably lead to despotism.  This view was not popular while the Powers of the West were still in alliance with Socialist Russia to fight facism in Europe.  In one passage, Hitchens shows how a quote by Orwell about European nations being too weak individually resist super-powers and needing to band together.  This quote was selectively edited to portray that these nations were too weak and needed to align with a super-power.</p><p>Orwell envied the freedom that was pervasive in America and its culture.  \"In America the tradition of nineteenth-century freedom is still alive, though no doubt the reality is as dead as it is here\" [in England].  This quote shows that he yearned for the freedom that he felt was a available in America but he also feared disappointment if he should ever go looking for it and find it long gone.  He was also very in love with the British culture he had been raised in and resented how Americans caricatured the English.</p><p>The image of Orwell that emerges is that of someone who wanted each individual to be allowed to pursue happiness, distrusted elites (especially leadership social classes), and loved intelligence.  He had a profound love for the pastoral English countryside and other staples of English life.  But in a practical way, such as when he write about those who idealize nature: \"The fact is that those who really have to deal with nature have no cause to be in love with it.\"</p><p>As much the humanist as he might have been, Orwell may have had shortcomings regarding women, both in his novels and in his writings.  Hitchens mentions that the women in Orwell's life were all strong-willed and very intelligent.  Other anecdotes seem to indicate that he held very progressive views, but maybe these had more to do with women's low status in society and that he saw them as one more exploited class.  He didn't care much for idealists that were all talk and no action, and his treatment of feminists was no different.</p><p>Late in his life, he drew up and shared a list <i>soft socialists</i> in what seems like a betrayal of his long hatred for the underhanded means of communists and fascists.  Hitchens tries to redeem Orwell by showing that the names on the list were either well-known for their softness, or were already a matter of public record, or were actually helped by their new-found publicity.  Dubious, and disappointing nonetheless.</p><p>Hitchens' book closes with a review of how Orwell's style progressed from the <i>angry young man</i> style of his early novels to his progressive hatred for totalitarianism that culminates in <i>Nineteen Eighty-Four</i>.</p><p>Overall, the book is an extensive look at Orwell's novels, with extras from his other publications and his life.  It does a great job to cover the ideas that Orwell expressed in his novels and how they were perceived by the literary elite.  He was a humanist that cared deeply about those oppressed by society and was very critical of the upper classes doing the oppression.  He witnessed the rise fascism and communism, appealing to populist and nationalist feelings.  He saw how the educated elites were dismantled so they could not justify opposition to would-be despots.  It is good, even now, to remember how democratic institutions can be co-opted by groups who seek only their own advancement at the expense of other members of society.</p>","publisher":"Basic Books","titles":[{"title":"Why Orwell Matters","link":"http://amzn.com/0465030505"}],"years":["2002"],"name":"Why_Orwell_Matters","stop":"2010-09-01","authors":["Christopher Hitchens"]},{"years":["2008"],"name":"The_Long_Tail","stop":"2010-07-22","authors":["Chris Anderson"],"acquired":null,"start":"2010-05-21","body":"<p>I first heard about the idea of the Long Tail on my first day at Google, back in 2005.  Four years later, I borrowed the book from work, out of curiosity.  The shorter commute and new friends on the train mean less time for reading, so this one might take me a bit to get through.</p><p>I like the three requisites for capitalizing on a long tail market:</p><ol><li>Democratize the means of production to generate a lot of content.</li><li>Means of distribution that are essentially free make that content available to everyone.</li><li>Powerful technological tools help make sense of it all.</li></ol><p>These three factors combine to create large numbers of niche markets that can sustain themselves.  Essentially, what used to be the province of the privileged few is now in the hands of everyone.  There will be lots of low quality products, but technology can help us find the worthy pieces hiding in there.  I love how it democratizes everything.  There is still a large demand for <i>hits</i> and critics, but the elites don't hold all the cards anymore and anyone can contribute.</p><p>The section on marketing in the Long Tail does a very good job of describing the new dynamics and some of the impact of end-user engagement.</p><p>The book does a good job describing new businesses that exploit the long tail, like Amazon and Google.  But it was written just before the explosion of YouTube and Facebook and Twitter.  Now, more than ever, we're in a world of citizen journalists and an empowered general population.  The book is very \"of the moment\" and it shows its magazine roots.  It throws around a lot of names that were relevant at the time of publication but who are not so relevant just a few years down the line.  Blockbuster and Rhapsody are gone now.</p>","publisher":"Hyperion","titles":[{"link":"http://amzn.com/1401309666","title":"The Long Tail"}]},{"years":["2008"],"name":"This_One_Time_At_Brand_Camp","authors":["Tom Fishburne"],"stop":"2010-05-07","acquired":null,"start":"2010-04-28","publisher":"Tom Fishburne","titles":[{"title":"This One Time, At Brand Camp","link":"http://amzn.com/1435759672"}],"body":"<p>A collection of satyrical cartoons about brand management.  Not quite as disfunctional as Dilbert, it is written from an insider's perspective.  And whereas Scott Adams is very critical of the corporate culture that he had to endure, Tom is very much in love with brand management and he takes us on a tour of its quirky landscape.</p><p>Each page shows one cartoon in the top half and Tom provides some commentary in the bottom half.  The commentary are interesting when they talk about the inspiration for a given cartoon, but too often they simply explain the cartoon for the audience.  I'm tempted to say that if a cartoon needs explanation, then it is a failed cartoon.  Unless you're being exclusive like <code><a target=\"_blank\" href=\"http://xkcd.com/\">xkcd</a></code>, <a target=\"_blank\" href=\"http://www.tomfishburne.com/tomfishburne/2010/03/sxsw-talk-innovation-lessons-from-cartooning.html\">as Tom explains on his blog</a>, in which case the point is for the cartoon <b>not</b> to be understood by the general public but only by the limited community it targets.  Again, cartoon + explanation becomes a losing proposition.</p><p>Nevertheless, it's a clever little book and a nice way to kill some time.  And you get to learn something about marketing and brand management at the same time.</p><p>I like this cartoon about <a target=\"_blank\" href=\"http://www.tomfishburne.com/tomfishburne/2008/06/the-consumers-d.html\">the higher cost of organic</a> products.  I agree that they are better for you, but it saddens me that the lower economic classes cannot afford them.  If it's better for you and will keep people healthy, then it should be made available to everybody.  Keeping all of society healthy is better for the overall economy than catering only to the rich and dealing with the sick poor.</p>"},{"years":["2010"],"name":"Prenez_le_control_de_votre_appetit","authors":["Angelo Tremblay"],"stop":"2010-04-23","acquired":null,"start":"2010-04-01","publisher":"Les &Eacute;ditions de l'Homme","titles":[{"title":"Prenez le contr&ocirc;le de votre app&eacute;tit ... et de votre poids","link":"http://www.amazon.ca/dp/2761927036"}],"body":"<p>Health and nutrition from a college professor that has been studying the field for the past 30 years.  Now that I work at <a target=\"_blank\" href=\"http://shopwell.com/\">ShopWell</a>, my aunt thought it might interest me.</p><p>It is very well written.  The author is very knowledgeable and has worked in this field for over 30 years.  His style is clear and concise, free of technical jargon and very approachable by the lay person.  He talks about the major impact of getting enough sleep on the metabolism.  He prones aiming to eat for you health and to recognize your body's signals that your not hungry any more, and your weight will take care of itself.  Diets where you always fell hungry don't work because the body fights back and you end up regaining the lost weight, and then some.</p><p>Well worth reading, if you can read French.  :-)</p>"},{"titles":[{"title":"A Twisted Garden","link":"http://amzn.com/098221040X"}],"publisher":"Kinetic MicroScience","body":"<p>This book was written by a former colleague of mine.  For once, I know the author.</p><p>I'm kinda annoyed that there are no chapters.  Once in a while, the narrative stops in the middle of a page and the action resumes at some later point at the top of the next page.</p><p>The novel reminds me of Arthur C. Clarke, showcasing technological advances for the near future and social trends more than the characters.  But is is more cyberpunk in nature, set in a completely dystopian future.  And sometimes, the author gets stuck on UI details, such as \"I touched the close control on the screen and it went black\" instead of the simple \"I turned it off.\"  He acknowledges influence from Neal Stephenson.</p><p>Technology is definitely the main character here.  The protagonists and the intrigue are only there to provide a framework to showcase various futuristic concepts and devices.  When the author's imagination runs dry of new ideas, the main plot is quickly brought to a conclusion and the novel ends.  Rather abruptly.</p><p>The beginning, where the author lays out a vast array of new concepts and ideas, was quite catchy and drew on my curiosity.  The middle part started to develop the main intrigue and attempt to provide the characters with a semblance of depth.  I was expecting some twists and turns, but everything was progressing quite linearly.  The end unforeseeable only in its brevity.  All plot lines are brought to an end and the story concludes in a way that felt rushed.</p><p>I think back to Umberto Eco's <i><a target=\"_blank\" href=\"http://amzn.com/025320318X\">The Role of the Reader</a></i> where Eco explains that the reader picks the parts of the novel that interests him or her and that the master novelist will weave multiple paths together in one work and let the reader pick the one that interests them the most.  Here, there are three obvious paths: technology in the various contraptions, sociology in the interactions between the character, and intrigue in the main plot.  The first one was a good hook but lacked cohesiveness.  The second led nowhere.  I got more and more interested in the third one when the first two petered out, but it received the least treatment of the three and ended too quickly, without any noticeable twists or turns.</p><p>Still an enjoyable read, but was disappointing in the end.</p>","start":"2010-03-08","acquired":null,"authors":["Simon Quellen Field"],"stop":"2010-03-27","name":"A_Twisted_Garden","years":["2008"]},{"acquired":null,"start":"2010-01-23","publisher":"Back Bay Books","titles":[{"link":"http://amzn.com/0316044938","title":"The Lovely Bones"}],"body":"<p>A touching story about loss.  Susie, the main character, has to adjust to loss of life and a new existence in <i>her heaven</i>.  The people she knew and whom she left behind have to adjust to their loss of Susie.  It's a very interesting look at grief and how different people cope with loss.</p><p>The author's concept of a personal heaven was very intriguing.  It is unfortunate that she didn't explore it further.  How does it operate?  Under what rules does it run?  It appears to be multi-layered, with some form of progression, as demonstrated by the short interlude with Susie's grand-father.  I understand that she wanted to focus more on what happens to the living, and I would have liked it better if she had kept the communication channel between the dead and the living strictly one-way.  As the years go by and Susie follows what's happening to the people she knew, does she mature too?  Either she is very mature for a 14 years-old or else she continues to grow through death.  Either way, the voice of the novel is clearly that of a 30-something, just like the author, for better or worse.</p><p>The characters are rather one-dimensional.  They set out on one track and follow it down the novel.  People who meet at 14-15 years old end up married to each other?  Gimme a break.  Otherwise, I did like her portrayal of teenagers: they are not overly prude, still preoccupied with sex, but with enough self-respect not to be too promiscuous.</p>","years":["2002"],"name":"The_Lovely_Bones","authors":["Alice Sebold"],"stop":"2010-02-06"},{"acquired":null,"start":"2009-12-25","body":"<p>A very hasty re-read during the holidays.  I skipped some of the more boring parts and focused on exposition about the main gimmick of the series: the paratwa.</p><p>First one best of the lot.  Others are typical three-act story: first act is self-contained.  Second act expands on the first and sets up the third.  Third act tries to explain everything, wrap up all arcs, and has unexpected twists.</p>","titles":[{"title":"Liege-Killer","link":"http://amzn.com/0812530756"},{"title":"Ash Ock","link":"http://amzn.com/0812530780"},{"title":"The Paratwa","link":"http://amzn.com/0812530934"}],"publisher":"Tor","years":["1987","1989","1991"],"name":"The_Paratwa_Saga","stop":"2010-01-03","authors":["Christopher Hinz"]},{"acquired":null,"start":"2009-10-12","body":"<p>The books open with this passage:</p><blockquote>  <p>If no one asks me about it, then I know what it is; but if someone asks me about it and I try to explain it to him, then I do not know what it is.</p><footer>St. Augustine</footer></blockquote>  <p>I just love Patrick S&uuml;skind.</p><p>The opening quote is about <i>time</i>.  S&uuml;skind co-opts it to talk about <i>love</i>.  When I first read it, I thought it applied equally well to good programming.  I think it really applies to any process of the mind that is deeply grounded in our personal experience.  Each one of us has certain thoughts that we understand intuitively, through our unique experiences.  When we try to explain these thoughts to someone else, we fail utterly because we cannot reason objectively about them and the other does not share our experiences.</p><p>This book is <i>very</i> short.  Too short, actually.  He starts down a number of promising avenues, but stops way too short.  And in the latter parts, he gives a very one-sided opinion in his comparison between Orpheus and Jesus.  I would have liked a slightly longer, more balanced exposition.  He can still come to the same conclusions, but it would feel less forced.</p><p>I enjoyed reading the book.  It brings up interesting questions.  But I was left wanting for more.  It felt a bit like a broken promise.</p>","publisher":"Overlook/Rookery","titles":[{"link":"http://amzn.com/158567950X","title":"On Love and Death"},{"link":"http://www.amazon.de/dp/3257235895","title":"<i>&Uuml;ber Liebe und Tod</i>"}],"years":["2005"],"name":"On_Love_and_Death","stop":"2009-10-15","authors":["Patrick S&uuml;skind"]},{"acquired":null,"start":"2009-03-25","body":"<p>I read Mr. Rashid's <i><a target=\"_blank\" href=\"http://amzn.com/0300089023\">Taliban</a></i> when it came out, right after 2001-09-11.  I was very impressed by his extensive knowledge of that part of the world.  As a journalist, he has been covering Central Asia pretty much since the Soviets invaded Afganistan in 1979.  He has been part of most major events in Afganistan and Pakistan.  He has interviewed pretty much everyone involved in the region's political scene during those years.  He has really deep knowledge that far surpasses anything I could expect from Western sources.</p><p>This book aims to cover the years from 2001 to 2008 and the aftermath of 9/11.</p><p>I remember being very depressed after reading <i>Taliban</i>.  It seemed liked the whole of Afghanistan was could not be salvaged.  The situation seemed hopeless.  But reading <i>Descent into Chaos</i> gave me hope.  The people of Afghanistan and Pakistan are very resilient and they will do the right thing if given a chance.  That is, when they are not being abused by communists, warlords, dictators, fundamentalists, corrupt officials, drug runners, all under the eye of Western powers.  But the glimmers of hope have been few and far between since 2001.  There are long periods of hardships for the population as various factions try to control the region.</p><p>This book is absolutely stunning.  Rashid takes you into the lives of citizens of both Afghanistan and Pakistan for the past ten years and covers all of the major events of this period.  He is extremely well documented, having personally interviewed or covered all the major players on all sides.  He also cultivates personal relationships with many key individuals in the region, including Afghan president Hamid Karzai, giving the author unparallel access to what they are thinking as events unfold.</p><p>There are many dimensions to the material in the book.  Time is an obvious one.  There are also many concerns, from fighting to security to the economy to the drug trade to international intervention.  And there is also the personal narative of the many individuals: Karzai in Afghanistan, Musharraf in Pakistan, Rumsfeld at the Pentagon, the US State Department, Taliban leaders, warlords, U.N. staff, and so on.  Each of these threads cross each other again and again in a very tight weave.  The level of complexity is what makes reading about real events such a rich experience.  It is impossible to disentangle any one of these threads in order to fit the linear format of a book, but Rashid tries his best.  The overarching concerns are the main organizational elements in the book.  There is a chapter on the security situation in Afghanistan between 2002 and 2005.  There is a chapter on economic development between 2002 and 2005.  There is a chapter on the flowering of the drug trade from 2002 to 2007.  There is a chapter on the emergence of the Pakistan Taliban.  As you go from one chapter to the next, you go back and forth both through time and through the cast of characters.  It gets very confusing very quickly, but Rashid gives us just enough reminders for us to keep it straight.  Almost.  The temporal jumping around is definitely what gave me the most trouble, as I tried to relate events in one chapter to those in the previous ones and which events had not happened yet.</p><p>As I was reading this book, events continued to unfold in Afghanistan and in Pakistan.  There is a new administration in the US and in Pakistan.  The Taliban is in the news regading Swat Valley.  A NY Times article was talking about the rise of heroin addiction in Kabul.  Former US ambassador Khalilzad considered running against Karzai for President of Afghanistan and might take a high-level position in his administration instead.  Two US researchers were on a show saying the Taliban insurgency in Pakistan was blown out of proportions by the media (it looks pretty serious in the book).</p><p>The downside of reading about recent events is that the book leaves you in the middle of the action.  You have to keep reading the newspapers to find the eventual resolution at some point in the future.  The upside is that you can keep reading about it for years to come.</p>","titles":[{"link":"http://amzn.com/0670019704","title":"Descent into Chaos: The United States and the Failure of Nation Building in Pakistan, Afganistan, and Central Asia"}],"publisher":"Viking","years":["2008"],"name":"Descent_into_Chaos","stop":"2009-05-20","authors":["Ahmed Rashid"]},{"titles":[{"link":"http://amzn.com/159562015X","title":"StrengthsFinder 2.0"}],"publisher":"Gallup Press","body":"<p>Starts with a cool idea: instead of spending time trying to get better at things you have no talent for, why not work at being great at things you have a natural affinity for?  Each of us has things they tend to be good at (talents), and things they tend to not be good at (let's call them handicaps).  Why should we spend time and energy overcoming our handicaps, at the expense of our talents?  At most, we'll be average at them for a lot of effort.  Instead, we should spend our efforts in line with our talents and become really great at them.</p><p>The book outlines 34 <i>themes</i>, or areas of strength that Gallup has identified after looking at <i>millions</i> of profiles.  It also gives you access to an online assessment that will magically tell you your top five strengths.  Each theme has a nice description that makes you warm and fuzzy inside.  Each also has activities to help you develop it.  It's kinda like astrology, really: the descriptions are so fuzzy and use such powerful words that no matter which one you happen to read, you'll find that it matches you at some level and will sound like something you'd want to get better at.  Luckily, there's the online assessment to make sure you only bother with five of them so you don't get too confused.</p><p>Of course, you cannot take the assessment without first purchasing the book.  The entire intro reads like a pressure sales pitch for a psychic hotline.  I'm very suspicious of opaque claims supported by pseudo-science with made-up names that come complete with a dead founder with a ludicrous made-up title that must be repeated in full every single time: <i>Father of Strengths Psychology, Dr. Donald O. Clifton</i>.</p><p>I like the premise of pursuing your own strengths, but the execution feels more like a religious cult than an exercise in reason.  I went along, just for the sake of entertainment.  My top five strengths are: Input, Context, Individualization, Intellection, and Adaptability.  A few of the others sounded good to me, like Futuristic, for example.  But the magical assessment program did not pick it when it used a whole slew of weird questions to somehow plumb my subconscious and decide on what my top five strengths were.</p><p>The book is essentially a sales pitch for the website.  It tells you precious little about anything.  It's only real value is in the code to take the online assessment.  The book is definitely <b>not</b> worth $20, and I would <b>not</b> pay $20 for a self-help test.  To me, it's barely a step above the get-rich-quick scam where you make a video on how to get rich in which you tell people to make a video on how to get rich.</p>","start":"2009-03-11","acquired":null,"authors":["Tom Rath"],"stop":"2009-03-12","name":"StrengthsFinder_2_0","years":["2007"]},{"body":"<p>I've been hearing about Salman Rushdie even since <i><a target=\"_blank\" href=\"http://amzn.com/0812976711\">The Satanic Verses</a></i>, but never really got around to reading his work.  Milan Kundera speaks very highly of him.  I got this book when Rushdie came to speak at Google.  He mentioned that the action took place in part in Renaissance Florence and that he even managed to include Dracula in the novel because of the period in which it is set.  This is promising, since I read quite a bit about politics during the Renaissance and also about Vlad the Impaler, aka Dracula.</p><p>The novel opens at the court of Mughal Emperor Akbar, a high point of Indian cultural development.  This is a area where I knew precious little and it was very interesting to educate myself via this novel.  Like Umberto Eco's novels, this one was researched very meticulously and the reader can get all kinds of little historical bits and pieces from it.  It also uses historical figures for the main characters and adds elements of the author's invention in between the pieces from the historical record.  Somewhat like Maurice Druon did in his cycle <i>Les rois maudits</i>, but whereas Druon wants to write a novel about History, Rushdie uses History as a backdrop against which he paints his own story.</p><p>The novel worked very well for me until near the very end, when part of the action moves to the New World and tries to use non-sensical metaphysics to explain temporal anomalies.  That last bit reminded me of Eco's <i><a target=\"_blank\" href=\"http://amzn.com/0156030373\">The Island of the Day Before</a></i> where the main character tries to go back in time by crossing the date line, under the belief that the date line has strange metaphysical properties.  But the remainder of the novel is quite excellent.</p>","publisher":"Random House","titles":[{"link":"http://amzn.com/0375504338","title":"The Enchantress of Florence"}],"start":"2008-06-18","acquired":null,"stop":"2008-08-07","authors":["Salman Rushdie"],"name":"The_Enchantress_of_Florence","years":["2008"]},{"years":["1992"],"authors":["Milan Kundera"],"stop":"2008-05-16","name":"Les_testaments_trahis","acquired":null,"publisher":"Gallimard","titles":[{"title":"Les testaments trahis","link":"http://www.amazon.ca/dp/2070758710"},{"link":"http://amzn.com/0060927518","title":"<i>Testaments Betrayed</i>"}],"body":"<p>Kundera draws parallels between the evolution of music and the novel in Western culture and how it shaped Western thought.  While his bias shows in many places, this is still a great exploration of artistic forces in Western culture for the past 500 years.</p><p>Part 1 sets up the <i>European novel</i> as the defining art form of the modernism and at the source of Western ideology.  By promoting ambiguity and letting characters define their own moral compass, they enabled the development of an individualistic thought in the Western philosophy and directly leading to our putting a value on the person as an individual.</p><p>Part 2 shows how Kafka's legacy has been tainted by the opinion of his biggest fan and how said fan used his position to twist and manipulate Kafka's art to support his own esthetic views.</p><p>Part 3 draws a parallel between the evolution of the European novel and that of European music in since the XIV<sup>th</sup> Century.  Both were moving away from the exhalted and highly stylized forms of the past and reaching for a deeper connection with the real world by studying what others might consider mundane.</p><p>Part 4 takes a single sentence from Kafka and shows how all of his French translations are wrong.  His point is that the author who moves his art forward takes it beyond what is considered \"good style\" at the time, whereas the translator usually tries to promote \"good style\", thereby undoes the author's innovation in order to bring the work back within accepted boundaries.</p><p>Part 5 analyzes a short story by Hemmingway to demonstrate how the modern novel tries to capture the essence of the present as it happens, not as a reconstruction of something that has happened or as an artificial construct that supports the action, but as it happens in real life, in all its mundanity and irregularity.</p><p>Part 6 contrasts the classic period, where form was all important and pieces include strong parts held together by <i>bridges</i> and structural elements.  Modernity breaks out of the form and does away with the weaker elements, keeping only the strong ones.  And this happened across Western culture, in music, novels, and even philosophy with Nietzsche.</p><p>Part 7 covers the artistry of Janacek as a one who ushered in modernity in Western music.  He also discusses how Czechoslovakia, with it's small country mentality, hindered his recognition by the larger cultural scene.  This is a theme he will revisit later in <i><a href=\"#Le_rideau\">The Curtain</a></i>.</p><p>Part 8 shows how novelists like Kafka and Tolstoi explored, thanks to the novel, aspects of the human psyche decades before science started looking them.  They showed how our opinions vary and evolve throughout our lives, and how at any one point, we try to make the best decisions based on incomplete information.  We should be careful when judging the past with our 20/20 hindsight.</p><p>Part 9 deals with artists and their attempts to control their legacy.  Stravisnky and Janacek fought long and hard against those who would make changes to their works, often removing the novelty they had introduced.  Kafka's efforts to nail down his legacy were spoiled by his executor, who published anything and everything he had ever written, including pieces Kafka thought were not ready, like <i>The Trial</i>.  Proust talked about how novelists show a different personality through their novels than that revealed in their lives, so seeking to interpret the novel as a key to the author's life is to miss the artistry.</p>","start":"2008-05-05"},{"authors":["Georges-H&eacute;bert Germain"],"stop":"2008-05-04","name":"L_homme_au_deficient_manteau","years":["2007"],"publisher":"Libre Expression","titles":[{"link":"http://www.amazon.ca/dp/2764803400","title":"L'homme au d&eacute;ficient manteau"}],"body":"<p>This is a biography of Marc Favreau, the actor behind the Qu&eacute;bec clown Sol.  I remember watching Sol in a kid's tv show when I was young.  Sol has been a fixture of the Qu&eacute;bec artistic scene since the 1960's.  Favreau died a couple years ago and the author was a personal close friend.  Sounds promissing.</p><p>The book paints a great portrait of the cultural scene in Qu&eacute;bec after World War II until the Quiet Revolution in the late 1960s.  It shows the great influence from France as local artists were trying to find their voice.  It shows that this period was not the <i>Great Darkness</i> that others claim it was, but that there was a vibrant cultural scene and that the questioning of institutions had already begun.</p><p>As to its main subject, Marc Favreau, the book turned out to be quite the hagiography.  If we are to believe Mr. Germain, Marc Favreau was quasi-perfect.  He always managed to get his way, everything he touched turned to gold, he never had any major disappointments in life.  Everybody loved him.  While it is hard to dispute most of the facts in the book, I suspect that maybe the author skipped some of the passages that would have cast a less favorable light upon his idol.  Now, I really want to re-read Milan Kundera's <a href=\"#Les_testaments_trahis\">Testaments Betrayed</a>, which deals exactly with this situation, where an artist's legacy is left completely in the hands of his or her most fervent fans, for better or for worse.</p><p>Marc Favreau was pretty much self-thought, which usually gives me pause.  But he seemed to do very well for himself.  Even though he taught himself everything he knew, he kept trying to learn new things throughout his life.  To me, that's the sign of an open mind and I know a lot of people with diplomas that don't have it.</p><p>The pages that described his death from cancer were very touching.  Very intimate, very human.</p><p>My memories of Sol go back to when I was a very young lad.  But I had not realized that even back then, the children tv shows where he played were already in rerun (<i>Sol et Gobelet</i> was produced from 1968 until 1971).  It was really nice to see how the character was born and evolved throughout the years.  Taking inspiration in the <i>Commedia dell'arte</i>, Favreau created a character starting with an auguste clown who suffered at the hands of the whitefaced clowns.  He evolved him through the years into the mouthpiece of an inner whiteface that is hiding inside Sol and is trying to guide society using the persona of Sol, an apparently harmless vagrant.</p><p>A while back, I got a DVD boxed set of Sol.  When I started watching them, I was a little disappointed that he didn't seem to be as funny as I remembered.  The gags were too easy, too disconnected.  The whole felt a little amateurish.  Now that I have a better understanding of the man behind Sol and the message he was trying to pass through his character, I want to look at Sol's shows once more to see if maybe it was just that I didn't get it.</p>","start":"2008-04-17","acquired":null},{"name":"The_Future_of_Reputation","authors":["Daniel Solove"],"stop":"2008-04-11","years":["2007"],"start":"2008-03-26","publisher":"Yale University Press","titles":[{"link":"http://amzn.com/0300124988","title":"The Future of Reputation"}],"body":"<p>A very interesting look at how the Internet is changing the way we communicate, even the less positive aspects of communication, such as gossip and shaming.  The book is full of real-life examples taken from recent Internet events, such as the Star Wars Kid.  In many of these cases, the person who first posted a piece of data did not intend for it to travel so far.  What could start aimed at a small group of friends would quickly get out of hand and be broadcast to the entire world.  Or someone trying to shame someone else for a minor infraction could lead to virtual lynch mobs.</p><p>You can think of it as information traveling away its source and being slowed by the friction of the medium.  Most people cannot afford very wide distribution using traditional media, so information does not travel very far from them.  Even with large distribution media such as newspapers and television, editors can decide what is worth publishing or not and can therefore influence the spread of information.  People can feel in control of the information they spread around.</p><p>But the Internet has a very low bar to entry and virtually no controls.  In essence, it is a frictionless environment for the spread of information.  Once you release something, it immediately escapes your control.  You are guaranteed that it will be taken as far as the most radical point-of-view within the audience, whether you like it or not.</p><p>One nice part of the book deals with social networking sites.  In the real world, we have many overlapping circles of relationships: family, friends, coworkers, etc.  We usually share information within one circle but rarely between circles.  Something that is of interest to my family may not interest my coworkers, or the members in my kendo club.  Pretty much all the social networking sites today have a flat view of my \"friends\" and lumps all relationships together.  On <a target=\"_blank\" href=\"http://facebook.com/\">Facebook</a>, there is no distinction between family and friends and coworkers and fellow kendo enthusiasts.  They all see the same profile, they all see what is happening in my other circles of relationships.  I cannot expose some fact through my profile to one group but not to the others.  There is a place in the market for a social networking solution that would let me manage groups of relationships and better mirror real-world behaviors.</p><p>There are two things that bug me about this book.</p><p>First, Solove wants to use the law to keep people from taking things too far.  It works for copyright law.  But the law operate within national boundaries.  There are no national boundaries on the Internet.  There is no body of law that can govern international events.  And why should American norms govern an incident between, say, someone in China and someone in Ghana.</p><p>Which brings me to the second thing that bugs me.  Solove decidedly takes an American-centric take on norms of behavior.  Not only that, but he seems to assume that a single set of norms can cover everybody.  There is a wide array of cultures out there and half the things that one cares about is annoying to most of the others.  There are countless things that are inconsequential to one culture and severe transgressions to another.  There cannot be a single set of norms that applies across the whole Internet.</p><p>It was still a good, quick read, nonetheless.</p>  ","acquired":null},{"years":["2003"],"stop":"2008-01-22","authors":["Rom&eacute;o Dallaire"],"name":"Shake_Hands_with_the_Devil","acquired":null,"body":"<p>A very raw first person account of the 1994 genocide in Rwanda, as seen by the military commander of the UN peacekeeping mission in place at the time.  Dallaire does not try to over-analyze everything or conjecture what everybody was thinking or not at the time.  He simply tells of his experience in Rwanda, what he saw, what he heard, and what he felt.</p><p>Dallaire is a French Canadian who grew up in Montr&eacute;al, torn between English- and French-speaking factions of youth, trying to rise through the ranks of a Canadian military that was decidedly condescending to French speakers.  But he was definitely not prepared for the challenge that he would face in Rwanda; one of which is his tendency to assume the best of intentions from people and his expectation that everybody wants to coexist peacefully.</p><p>One downside to this first-person testimony style of writing is that the book abandons the story of Rwanda as soon as Dallaire leaves Africa.  He makes just a few allusions to \"what happenned afterward,\" but I had to go to Wikipedia to find out what came of many of the players in post-genocide Rwanda.  In the opening of the book, Dallaire said he would not presume to analyze the situation in Rwanda or probe the hearts of the principal players, but would simply testify to what he had seen and what he had heard and what he had done.  He delivers with zeal on this promise.</p>","titles":[{"title":"J'ai serr&eacute; la main du diable: la faillite de l'humanit&eacute; au Rwanda","link":"http://www.amazon.ca/dp/276480072X"},{"link":"http://amzn.com/0786715103","title":"<i>Shake Hands with the Devil: The Failure of Humanity in Rwanda</i>"}],"publisher":"Libre Expression","start":"2007-12-05"},{"titles":[{"link":"http://amzn.com/0446579807","title":"God Is Not Great: How Religion Poisons Everything"}],"publisher":"Twelve","body":"<p>A little bit foaming at the mouth and decidedly one-sided.  Hitchens goes to great length to describe all that is wrong with religion but does not really take the time to compile some of what is right with it.  I think there would still be more bad than good, but his argument would be that much stronger if it appeared like he had done <i>all</i> his homework.</p><p>Hitchens makes an argument that religion was useful during the infancy of our species, but we've outgrown the need for it.  We invented stories to explains things when we had no better explanation, but now science and philosophy have given us tools to help us understand the universe much better.</p><p>He includes references to Daniel Dennett and his <a href=\"#Breaking_the_Spell\">Breaking the Spell</a>.  He also makes me want to read Bertrand Rusell, now.  While I was reading the book, I watched some of his videos on <a target=\"_blank\" href=\"http://youtube.com/watch?v=sD0B-X9LJjs\">YouTube</a> and I ended up watching others by Sam Harris.  He has an interesting point of view too.</p>","start":"2007-11-02","acquired":null,"authors":["Christopher Hitchens"],"stop":"2007-11-21","name":"God_Is_Not_Great","years":["2007"]},{"years":["2005"],"name":"The_Trouble_With_Islam_Today","authors":["Irshad Manji"],"stop":"2007-10-18","acquired":null,"start":"2007-10-02","publisher":"St. Martin's Griffin","titles":[{"title":"The Trouble With Islam Today: A Muslim's Call for Reform in Her Faith","link":"http://amzn.com/0312327005"}],"body":"<p>Irshad came to give a talk at Google and they were handing out her book.  The talk was engaging and I decided to read the book to see more of what she had to say.</p><p>It is really nice to see a perspective of Islam from the inside.  Irshad questions many aspects of her religion but wants to hold on to it, so she seeks answers that can reconcile her with it rather than turn her away from it.  It is very personal and thought provoking.</p><p>Towards the end, she touches upon the concept of <i>individuality</i>, the ability for each one of us choose who we want to be and contribute to society, each in our own way.  This resonates with a feeling I had at previous jobs where I felt I didn't have to toe the party line all the time as long as I was being constructive most of the time.  There are always those who feel that everybody must accept the mindshare all the time and who believe in conformity instead of diversity of ideas.</p>"},{"name":"Target_Iraq","stop":"2007-10-01","authors":["Norman Solomon","Reese Erlich"],"years":["2003"],"start":"2007-09-25","body":"<p>Reese Erlich was at Google to promote his book <a target=\"_blank\" href=\"http://amzn.com/0977825353\">The Iran Agenda</a> and though I was too late to get a copy of it, he had a few copies of this book for sale, so I got one for $10.  It was published just before the U.S. went in Iraq, so the tone throughout is of impending war with still a fleeting hope for peace.  It all seems so long ago.</p><p>A long laundry list of the lies perpetrated by the Bush administration as it built its case against Saddam Hussein and how the media were in on it.</p><p>The two most interesting pieces are analyses of a speech by President Bush and the text of U.N. Security Council Resolution 1441.  Each sentence is commented by multiple political experts.  It was really interesting to see the use of language and how innocuous sentences can be twisted to mean anything.</p><p>Again, many of the facts are anecdotal and even though tragic, I sometimes wondered how widespread some of the opinions were.  For instance, the authors blame the sanctions imposed on Iraq for the hardships endured by the civilian population.  Not lifting these sanctions is causing a humanitarian crisis within the country.  How much of it is really the responsibility of the parties enforcing the sanctions and how much is the responsibility of the Iraqi government?</p>","titles":[{"link":"http://amzn.com/1893956393","title":"Target Iraq: What The News Media Didn't Tell You"}],"publisher":"Context Books","acquired":null},{"name":"Harry_Potter_and_the_Deathly_Hallows","stop":"2007-07-26","authors":["J. K. Rowling"],"years":["2007"],"start":"2007-07-21","body":"<p>Great Harry Potter, but exposes many of the limitations in the Harry Potter series.  Rowling's target reader in an eleven year old.  This limits her writing both in the complexity of the plots and in the subject matters she can address.</p><p>The storyline is very linear.  We follow Harry as he goes about his quest.  We see everthing through his eyes.  There were many opportunities to explore other points of view, like Ron's or Hermione's, to get inside their head, see their own struggles, but we only get to see what is externalized, in as much as it affects Harry.  Compare Harry's first kiss with Ginny in <a href=\"#Harry_Potter_and_the_Half_Blood_Prince\">Harry Potter and the Half-Blood Prince</a> against Ron and Hermione's first kiss in this book.  The latter lacks any emotion or real warmth; it is almost comical in its development and its timing.  I was disappointed by its banality.  I wanted more than this after following these characters across seven books and waiting for this moment for the past four.</p><p>There are also many opportunities to explore side plots, which Rowling totally ignores.  We only get echoes of what's hapenning at Hogwarts, or what the other members of the Order of the Phoenix are doing while Harry is pursuing his quest.</p><p>To keep the plot simple and within the grasp of an eleven year old, Rowling relies heavily on widely used formulas: bringing back every possible character ever mentioned for the big finale, Mrs.  Weasley as the super-protective supermom, the whole \"King's Cross\" chapter.  In parts, it is so formulaic that it appears downright cheezy.  The same goes for the entire epilogue, where apparently Ginny doesn't get a say in naming her own children.  In the entire series, each character has their own name, no one is burdened with having to live up to the name of some ancestor, except for Tom Riddle.  This last bit, in the epilogue, is a strange and troubling departure, one I don't find particularly tasteful.</p><p>To illustrate how the Harry Potter universe is ever unchanging and how nothing beyond the main protagonists has any opportunity to evolve, witness how House Slytherin removes itself from the final battle with Voldemort.  This would have been a great occasion for the four houses to put aside their differences and come together to the defense of their school.  It could have begun a healing process for the Wizarding society that is divided by the issues put forth by Voldemort.  It could have shown to judge people on an individual basis, not solely by their association.  It could even have ushered an new era where students are no longer sorted into Houses anymore, like we hear Dumbledore wish for in one flashback.  But Rowling does not want to take it that far; Slytherins are evil and selfish and they will not fight for their school.  In the glimpse of the future that we see in the epilogue, things are still the same at Hogwarts, with Houses and sorting and so forth.</p><p>The events in the Harry Potter series present a major challenge for the Wizarding society.  As they make their way through those traumatizing times, they have an opportunity to learn something about themselves and emerge on the other side transformed and enlightened, changed for the better.  Here is an opportunity for change on a societal scale that Rowling completely passes by.  She had a chance to reinvent her universe based on a new foundation and she compeltely ignores it.  Instead of a story about how an entire society can grow through the actions of a courageous few, we get a story about a single individual's struggles.  I guess this is one of the risks you take when you willingly dumb down a story \"for the greater good.\"</p><p>Thus brings me to the themes Rowling choses to discuss in her novels.  On the one side, she wants to portray realistic teenagers, with all that entails: search for self-identity, peer pressure, and of course puberty.  On the other side, she's writing for pre-pubescent readers, which pretty much precludes any sexuality angle.  I think this is slightly disingenuous.  All relationships are utterly platonic and dating is reduced to holding hands and taking long walks by the lake, stealing an occasional kiss when nobody is watching.  Harry is afraid to display any signs of affection towards Ginny in front of her mother.  Ron and Hermione refrain from any intimacy when Harry is present.  There is a major dissonance between what you would expect of normal teenagers like the ones in the story and the behaviors Rowling has them display.</p><p>I was re-reading the scene in <a target=\"_blank\" href=\"http://amzn.com/043935806X\">Harry Potter and the Order of the Phoenix</a> where Harry kisses Cho Chan.  Afterwards, Hermione comments on Cho's state of mind and her conflicting feelings towards Cedric and Harry.  She goes so far as to hint Cho could suffer socially for going out with Harry after she had dated Cedric.  She dated him for a few months and it's been over six months since he died at this point.  Is she expected to go into mourning forever for a guy she briefly dated?  She is only 15 or 16 years old!</p><p>In this book, Harry, Ron, and Hermione live together in a tent for over six months, cut off from the rest of the world and with nothing better to do than stare at each other.  Ron and Hermione are obviously attracted to each other and yet nothing happens.  This is utterly unbelievable.  It goes way beyond any notion of suspension of disbelief.  It borders on stupidity.  If you put any three normal 17 year olds in a tent for six months, someone gonna end up pregnant.  Even keeping the whole thing chaste, there in no point in Ron and Hermione denying their love for that long.</p><p>One character that has evolved as the series progressed is Neville Longbottom.  He starts out as an inept nerd that everyone picks upon.  By the middle of the series, he starts being of genuine help.  He really comes into his own in this book, though.  He shows courage and skill and even a modicrum of leadership.  I wish we could have said the same of the other characters.  Draco Malfoy is one very disappointing failure on that front.  At the end of <a href=\"#Harry_Potter_and_the_Half_Blood_Prince\">Harry Potter and the Half-Blood Prince</a>, there is a brief moment of possible redemption for Malfoy.  But it is fleeting and amounts to nothing in the end.</p><p>What I really liked of the first three Harry Potter novels was how Rowling kept expanding her fantastic universe.  But by <a target=\"_blank\" href=\"http://amzn.com/0439139597\">Harry Potter and the Goblet of Fire</a>, she had started to close down on expansion and starting tying everything together.  In this book, she finishes this process and ties the last few knots that close the entire construction.  It goes as revealing Harry's ancestry up to some ancient and forgotten wizard family and even giving him an ancestor in common with Voldemort.  I don't like these devices; they tend to make everything rather incestuous.  I like it much better when the author leaves things open to interpretation and lets the reader's imagination roam.  It is not necessary to fully specify every single detail and relate everything to the action that is going on at the time.  The universe does not have to be hermetic.  When you first read <a target=\"_blank\" href=\"http://amzn.com/0590353403\">Harry Potter and the Sorcerer's Stone</a>, there is a rich tapestry of things that are thrown in off the cuff and that the reader is free to flesh out as they like.  By the time you get to <a target=\"_blank\" href=\"http://amzn.com/0545010225\">Harry Potter and the Deathly Hallows</a>, the world is fully defined by the author and the reader's role becomes much more passive.</p><blockquote>  <p>It may seem ironic that I rail against Rowling for defining everything in her novels when that's what I admire in Tolkien.  And maybe it's not exactly fair to compare Rowling to Tolkien.  But in Tolkien, while everything has a backstory, not everything is intimately related to the main story.  Rowling goes the other way and tries to relate every element in the universe to Harry's struggles.</p></blockquote>  <p>I quick point of curiosity: Rowling never even mentions the Americas or Asia or Africa.  All the action takes place in Western Europe, with just a very brief mention of Egypt.  It is as if they didn't even exist.  Voldemort can conquer the entire world simply by subjugating Great Britain.</p><p>But all this is nitpicking.  I thoroughly enjoyed reading this lastest book and I had a hard time putting it down.  All the things I pointed out were just minor irritations while I was reading.  Harry's story comes to a satisfactory conclusion, even if the relationship between Harry and Voldemort is so tangled and convoluted that it borders on the ridiculous.  Many of the more subtle associations have to be explained by other characters and it would have been nice if the reader had been given enough clues to figure it out on their own.  Even the parts that are formulaic are exciting and engaging, which is why those formulas are so popular to begin with.  Once you accept that the book was written for eleven year olds, it is very captivating and fulfilling.</p>","publisher":"Scholastic","titles":[{"title":"Harry Potter and the Deathly Hallows","link":"http://amzn.com/0545010225"}],"acquired":null},{"stop":"2007-06-20","authors":["George Orwell"],"name":"Animal_Farm","years":["1946"],"body":"<p>Short and to the point.</p><p>Orwell shows again his theory of revolutions where the middle class (pigs) harness the lower class (other animals) to overthrow the upper class (humans), but only to put themselves as the new upper class.  For the lower class, nothing changes.  Orwell will expound further on this principle in <a target=\"_blank\" href=\"http://amzn.com/0452284236\">Nineteen Eighty-Four</a>.</p><p>It is quite obvious that Napoleon refers to Stalin and Snowball to Trotsky, but I wonder if Orwell was thinking of anyone else in particular with other characters like Squealer or Boxer or Minimus, or Benjamin.  Most of the other named characters are most likely just generic proles.  But Benjamin with his long memory and Boxer with his unwavering devotion to Napoleon stand out from the crowd and could very well refer to proeminent participants of the Communist Revolution.</p><blockquote>  <p>It turns out the <a target=\"_blank\" href=\"http://wikipedia.org/wiki/Animal_farm\">Wikipedia article on Animal Farm</a> confirms and expands on my initial thoughts.</p></blockquote>  <p>I like how right from day one, Napoleon is already scheming and doing things behind the backs of the other animals, such as the business with the milk.  He is also very quick to get the pigs preferential treatment on the grounds that their work is so much more important than anybody else's.  Right from the start, the other animals didn't stand a chance.</p><p>In this book, Orwell shows how the Revolution's transition happens and how the new status quo is achieved.  In Nineteen Eighty-Four, he will show how this status quo is maintained, at least for a while.</p>","titles":[{"link":"http://amzn.com/0451526341","title":"Animal Farm"}],"publisher":"Signet Classic","start":"2007-06-14","acquired":null},{"start":"2007-05-30","body":"<p>Christopher Tolkien strikes again.  This time, he worked really hard to limit the editorial work, like he did in <a target=\"_blank\" href=\"http://amzn.com/0618391118\">The Silmarillion</a>, and to present a cohesive text out of all the different versions found in <i>The History of Middle-Earth</i>.  Mission accomplished.  The introduction does a half-decent job of setting the stage from all the material leading to the story of T&uacute;rin, so that the main text can proceed without to much exposition.  But I'm not sure how much of this intro would actually stick with a reader unfamiliar with Tolkien's tales of the Elder Days.  Even I had to refer to the map fairly often to keep up with the development of the story.</p><p>As I was reading this book, I sometimes went back to my other Tolkien books to compare versions.  It was nice to see all the details for some of the scenes, instead of the summarized version in <i>The Silmarillion</i>.  Like the one with Saeros, for instance.</p><p>I also liked the writing style too; it suggests old heroic tales and myths.  For instance:</p><blockquote>  <p>Huor, his brother was tall, the tallest of all the Edain save his own son Tuor only, and a swift runner; but if the race were long and hard H&uacute;rin would be the first home, for he ran as strongly at the end of the course as at the beginning.</p></blockquote> ","publisher":"Houghton Mifflin","titles":[{"link":"http://amzn.com/0618894640","title":"The Children of H&uacute;rin"}],"acquired":null,"name":"The_Children_of_Hurin","stop":"2007-06-10","authors":["J.R.R. Tolkien","Christopher Tolkien"],"years":["2007"]},{"acquired":null,"start":"2007-04-05","body":"<p>A colleague suggested this book to me, saying it was in the somewhat along the same line as <a target=\"_blank\" href=\"http://amzn.com/0060838582\">Fast Food Nation</a>.</p><p>Pollan identifies four <i>food chains</i> that go from where the food is produced to our plates.</p><dl><dt><b>industrial</b></dt><dd> Based on corn and highly processed.  Everything on the plate comes from corn: corn-fed steer, corn-fed chicken, high-fructose corn syrup.  Relies a lot on heavy mechanization, which can dehumanize the whole thing.</dd><dt><b>big organic</b></dt><dd> An effort to return to the roots but still supply a large scale market.  The rejection of hormones, artificial fertilizer, and antibiotics makes the whole enterprise more risky.  Again, heavy mechanization is needed to meet the demand.</dd><dt><b>small organic</b></dt><dd> Aka <i>slow food</i>.  Self-reliance and a focus on tightly integrated ecosystems.  Everything on the farm is part of a cycle.  Nothing is goes to waste; one thing's waste is another thing's source of nutrition.  Each producer must optimize according to its specific circumstances, which creates issues of scale.</dd><dt><b>foraging</b></dt><dd> Picking directly from nature.  This is where we are closest to our place in the world's ecosystem.  Completely impractical in a modern society, but interesting nonetheless.</dd></dl>  <p>My sister studied food processing and now works as part of the industrial food chain that the author describes.  While he mentions all the downsides of industrial food making, he also highlights how that process strives to be always more efficient and feed everybody at lowest cost.</p><p>I liked that the author actually went to the length visiting farms and talking with the people involved.  Many of the issues he could cover from a first person's perspective.  But in most cases, the experiences are too removed from his normal life for him not to be completely overtaken by them.  One example is when he goes hunting, something he admits his upbringing did not prepare him for.  He gets caught up in the thrill of his first hunt and generalizes his newfound state of mind to something all hunters experience all the time.  From my own experience with martial arts, I can tell that this early exhilaration eventually quiets down and the mind clears out to go about its business, as exemplified by his hunting buddy who stayed cool in the action.  So some of his reflexions may be questionable, but the book is still filled with lots of factual information and was very informative.</p><p>Towards the end, I was reminded of one of the lessons from Antoine de St-Exup&eacute;ry's <i>Little Prince</i>: people and things become special to us when we spend time on them.  And this includes our food: the more you invest of yourself in preparing a meal, the more special it becomes and the more personal too.</p>","publisher":"Penguin Press","titles":[{"link":"http://amzn.com/1594200823","title":"The Omnivore's Dilemma: A Natural History of Four Meals"}],"years":["2006"],"name":"The_Omnivore_s_Dilemma","stop":"2007-05-12","authors":["Michael Pollan"]},{"name":"The_No_Asshole_Rule","authors":["Robert I. Sutton"],"stop":"2007-03-18","years":["2007"],"start":"2007-03-10","publisher":"Warner Business Books","titles":[{"title":"The No Asshole Rule","link":"http://amzn.com/0446526568"}],"body":"<p>A colleague suggested this book to me, saying it was about a manager we had had at a previous job.  Hehe.</p><p>Helps you recognize the bad people in your life.</p>","acquired":null},{"start":"2007-02-17","body":"<p>What a treat.  This book felt like the best read I've had in a long time.  This may seem unfair to some of the great books I've read recently, but this one was at the same time instructive and of very easy access.  It covered everything from the technical aspects of painting frescos to the artistic concerns that went into the vault of the Sistine Chapel, to the geo-political landscape of Italy at the beginning of the 16<sup>th</sup> Century.</p><p>The books starts with Michelangelo's early career and how he landed the commission to fresco the vault of the Sistine Chapel.  It was very interesting to see the life of a tradesman in those days.  The author goes over Michelangelo's character and his relationships with various figures of the days.  As the book follows the progress on the vault, we are made privy to the ever changing political landscape and the ongoing competition with Raphael, as each one pushes the boundaries of art.</p><p>I have read quite a bit about the Papacy during the Middle-Ages and this was a very nice refresher of the events in Northern Italy at the time.  The book is as much about Pope Julius II as it is about Michelangelo.  But the real focus of the book is the fresco and its numerous panels and figures.  The author walks us over all the difficulties, tribulations, and inventions that continually happened throughout the project.</p><p>The book has many illustrations and nice color plates of the entire vault.  But for some reason, it is missing the two pendentives from the altar wall that were considered by Michelangelo's contemporaries as his best work.  There are also other works, notably by Raphael, that are not depicted and I had to go to the Internet in order to see them.  But it was still a very enjoyable read that gave me a new prespective on this cornerstone of Western culture.</p>","titles":[{"link":"http://amzn.com/0142003697","title":"Michelangelo and the Pope's Ceiling"}],"publisher":"Penguin Books","acquired":null,"name":"Michelangelo_and_the_Pope_s_Ceiling","stop":"2007-03-08","authors":["Ross King"],"years":["2003"]},{"years":["1985"],"authors":["Patrick S&uuml;skind"],"stop":"2007-02-15","name":"Das_Parfum","acquired":null,"publisher":"Livre de Poche","titles":[{"title":"Le Parfum, Histoire d'un meurtrier","link":"http://www.amazon.ca/dp/2253044903"},{"link":"http://amzn.com/0375725849","title":"<i>Perfume: The Story of a Murderer</i>"},{"title":"<i>Das Parfum.  Die Geschichte eines M&ouml;rders</i>","link":"http://www.amazon.de/dp/3257228007"}],"body":"<p>A friend gave me this book in 1990 and I really enjoyed it.  It still stands out as a gift that was totally unexpected, totally not the kind of book I would have gone for, and yet it was an amazing experience to read this book and discover its story.  The other Friday, I was just looking for a movie to go to and discovered quite by accident that they had made a movie of it.  I immediately called a buddy of mine who had read the book in high school in Germany and we hurried down to the cineplex to see it.  The movie was fabulous and made me want to read the book again.</p><p>I got interrupted halfway by having to read another book for work.  Luckily, this didn't take too long.</p><p>Wow!  What a treat.  This novel just blows your mind.  It is very original in the way it presents an otherwise banal story.  S&uuml;skind does a great job of bringing to life the world of Rennaissance perfumers and life in Paris at that time.  I really like how the author describes each and every scene mainly through its smells.  This is a novel about the sense of smell and S&uuml;skind does a great job of awakening us to all the smells that surround us every day.  And of course, he chose a setting that must have been rich in smells of all kinds: mid-18<sup>th</sup> Century France, and Paris especially.  And one funny tibbit: S&uuml;skind seems to take pleasure in killing off the majority of his secondary characters the moment they leave the story.  This works particularly well in the movie, turning it into a kind of dark comedy.  The main subject is dark enough that these moments of tragi-comedy are most welcome and lighten the mood a little bit.</p><p>One problem I had with the book was how the author avoided the Seven Year War by making Grenouille sleep through it in a cave in a remote area of France.  Now granted the character needed the period of inner development and the author needed to skip a period of European history that would have greatly reduced the mobility of his character, but still.  <i>He slept in a cave for seven years.</i> Come on!  Luckly, the novel picks up from there.</p><p>I find it interesting that the movie softened Grenouille somewhat.  In the movie, he appears as a simple soul with one obsession who is rather oblivious to the human cost of his enterprise.  In the novel, Grenouille is much darker and actually arbors a deep hatred for humanity.  It is interesting that the director figured that audiences would react better to a variation on Forest Gump than one of Hannibal Lecter.</p>","start":"2007-01-08"},{"years":["1990"],"stop":"2006-11-27","authors":["Milan Kundera"],"name":"L_immortalite","acquired":null,"body":"<p>I read this book when it came out and recently I felt the urge to read it again.  I remembered bits and pieces, but large chunks are missing.</p><p>Once again, Kundera is exploring the human psyche using strongly typed characters that exemplify the aspects he wants to cover.  This one is interesting in that the author is himself a character in the novel.  He starts by describing how he got the idea for his main character, fleshes it out with secondary characters, and by the time we reach the end, he is actually meeting the characters himself.  You have to read it to really appreciate it.</p><p>There are many clusters of characters.  Agn&egrave;s and Paul and Laura and Bernard (the nature of relationships).  Goethe and Bettina (the pursuit of fame and immortality).  Goethe and Hemmingway in the afterlife (on the consequences of fame and immortality).  Rubens (the pursuit of sex).  Kundera and Professor Avenarius (futility).</p>","publisher":"Gallimard","titles":[{"link":"http://www.amazon.ca/dp/2070718395","title":"L'immortalit&eacute;"},{"link":"http://amzn.com/0060932384","title":"<i>Immortality</i>"},{"title":"<i>Nesmrtelnost</i>","link":null}],"start":"2006-11-03"},{"name":"Discours_sur_les_sciences_et_les_arts","stop":"2006-09-21","authors":["Jean-Jacques Rousseau"],"years":["1971","(1750&nbsp;&amp;&nbsp;1755)"],"start":"2006-08-24","body":"<p>Back in high school, I had to read the <i>Discourse on the Origin and Basis of Inequality Among Men</i>, but I had never read the first part of the book we had.  Now, in part out of curiosity and in part out of nostalgia, I decided to take a look at it and maybe even re-read the second discourse.  I wanted to see what I might have missed the first time around.</p><h3>Discourse on the Arts and Sciences</h3>  <p>Already, Rousseau has idea that man is fundamentally good and that it is civilization that makes him bad.  He upholds his version of virtue as above all else.  His version is grounded in service to the community an putting the greater good to the group above personal gain.  Anything else leads to inequities and all evils.</p><p>Rousseau's point-of-view reminds me of what I understand of wahhabism in the islamic world.  Both praise an earlier state of society where everything was better.  Both recommend letting go of many modern concepts and inventions.  Simpler times called for simpler ways and there were fewer opportunities for actions that promote one person's interests at the expense of others.</p><p>The writing style relies on the reader having a strong foundation of classical learning.  He often goes back to the Greek Antiquity and the conflict between Athens and Sparta.  He is very critical of scholasticism, but I guess it is normal for someone from the Enlightenment to dismiss medieval thinkers.</p><p>The style of his responses is very interesting.  After going to great lengths to explain why his works stands on its own, doesn't need to be defended, and how his opponent didn't really disagree with him in the end, he proceeds to dismantle the critic's opinions one by one.</p><p>In this work, he recommends a serious study of the Scriptures as all one really needs to lead a virtuous life and be mindful of others.  His calvinistic roots are showing.  He does not address other religions.  Are Hebrew or Muslim texts just as good for this purpose as the Christian Bible?  And what about Eastern religions? Maybe the thought didn't occur to him, immersed as he was in a Christian world.</p><h3>Discourse on the Origin and Basis of Inequality Among Men</h3>  <p>The first discourse was drawing comparisons to ancient Greeks.  The second discourse goes on straight through to the most primitive societies.  He is trying to paint a picture of man's <i>natural state</i> from before he started living in society.</p><p>I keep comparing this text to Desmond Morris' <i>The Naked Ape</i>.  Rousseau keeps ranting about how people take their assumptions about the way they live and put them on how people lived in the past.  He chastizes other philosophers that put modern ideas in the head of primitive men.  But he does not totally escape from the trap himself.  In many places, his European bias shows.  And nowhere so plainly as in his treatment of women.  They just don't factor in, according to his views.  Morris had the benefit of 200 more years of scientific thinking, a secular education (I think), and he could count on the theory of evolution.  Rousseau has not of these things, though he touches on how long it would have taken for the natural man, barely more than an animal, to discover and develop the basic tools for living in a society: language, building, fire, agriculture, metal working, etc.</p><p>It also reminds me of Daniel Dennett's <i>Breaking the Spell</i> where he sees the development of religion and faith as an evolutionary process.  Rousseau cannot articulate the impact of a small differential over many generations, but his reasoning follows in the same direction.</p><p>I think Rousseau idealizes the natural state a little too much.  The fact that he is an armchair naturalist, living in a tamed European countryside, is obvious when he says things like how in nature, no one is ever sick and that all creatures act with moderation.  He does not consider the higher infant mortality rate or the dangers of childbirth, to name just two.  I guess these things didn't matter to 18th Century European minds.</p><p>But it is still amazing how he diverges from the accepted thinkings of his days, specially those influenced by religion.  His point-of-view is definitely humanistic.  At the time it was published, it was yet another work that removed Man from center stage and questioned his dominion over Nature.  No wonder his contemporaries found it shocking.</p><p>Just as the first discourse laid the foundation for the second one, this one lays the foundation in its turn for Rousseau's <i>The Social Contract</i>.  I'm tempted to read that one, now.</p><p>Links:</p><ul><li><a target=\"_blank\" href=\"http://fr.wikipedia.org/wiki/Discours_sur_l%27origine_et_les_fondements_de_l%27in%C3%A9galit%C3%A9_parmi_les_hommes\">Discours sur l'origine et les fondements de l'in&eacute;galit&eacute; parmis les hommes</a> in Wikipedia</li><li><a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Discourse_on_the_Arts_and_Sciences\">Discourse on the Arts and Sciences</a> in Wikipedia</li><li><a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Discourse_on_Inequality\">Discourse on the Origin and Basis of Inequality Among Men</a> in Wikipedia</li></ul>","publisher":"Garnier-Flammarion","titles":[{"title":"Discours sur les sciences et les arts","link":"http://athena.unige.ch/athena/rousseau/rousseau_discours_sciences_arts.html"},{"title":"Discours sur l'origine et les fondements de l'in&eacute;galit&eacute; parmis les hommes","link":"http://athena.unige.ch/athena/rousseau/rousseau_discours_inegalite.html"},{"title":"<i>Discourse on the Arts and Sciences</i>","link":"https://en.wikipedia.org/wiki/Discourse_on_the_Arts_and_Sciences"},{"link":"http://www.constitution.org/jjr/ineq.htm","title":"<i>Discourse on the Origin and Basis of Inequality Among Men</i>"}],"acquired":null},{"acquired":null,"start":"2006-07-31","body":"<p>Second reading.  I first read this book while in highschool.</p><p>Lots of possible allegories is possible, here.  Each character clearly illustrates some concept that was important to Mishima.</p><p>Now that I have become more familiar with Japanese culture through kendo, I was better able to appreciate the novel.  Truly a masterpiece.</p>","publisher":"Gallimard","titles":[{"title":"Le Pavillon d'Or","link":"http://www.amazon.ca/dp/2070366499"},{"title":"<i>The Temple of the Golden Pavilion</i>","link":"http://amzn.com/0679752706"},{"link":null,"title":"<i>Kinkakuji</i>"}],"years":["1961"],"name":"Kinkakuji","stop":"2006-08-17","authors":["Yukio Mishima"]},{"acquired":null,"start":"2006-05-09","body":"<p>The author takes a critical look at religion as a human, natural phenomenon, subject to forces from the natural world.  In the opening chapters, he goes to great lengths to appear non-threatening to religious people, trying to convince them that their religion is deserving of a critical look.  It's a very different style from other stuff I have read where the author is usually much more straight-forward (e.g., Noam Chomsky or Milan Kundera).</p><p>On the same day I started reading this book, which proposes to apply the scientific method to the study of religion's evolution, I attended a talk by <a target=\"_blank\" href=\"http://kk.org\">Kevin Kelly</a> on the history of the scientific method and it will likely continue to develop in the next 50 years.  Nice coincidence.</p><p>Dennett proposes that religion evolved following the mechanisms of memetics.  Various memes compete for survival within human culture and the <i>fittest</i> perpetuate across generations.  Following this view, if a meme, an idea, is too foreign to be transmitted unchanged from one generation to the next, it will only result in a short-lived cult that will most likely not survive its founder.  If, on the other hand, the meme is very useful (or <i>perceived</i> useful) to its hosts, it will be passed on to descendants and thrive.  As situations changes, new memes are introduced and old ones die.  Dennett proceeds to examine many elements of religious experiences, from folk religions and shamans to organized religions with controling bodies, and determines for each element what may have given rise to it, what conditions are needed for it to thrive, and how many of them may have combined to lead to today's religious landscape.</p><p>Since the word <i>atheist</i> has a bad rep, he mentions that increasingly, non-religious people are refering to themselves as <i>brights</i>, much in the same way that homosexuals refer to themselves as <i>gays</i>.  They do not imply by this that non-brights are the opposite of <i>bright</i>, much like non-gays are not <i>sad</i>, they're <i>straight</i>.</p><p>The style of the book takes some getting used to, at least for me who is not used to the Socratic method.  Most assertions are put down as rhetorical questions, so you're never sure if the author is opening a new line of questioning or closing an old one.  Also, the presentation style lacks an establishing section at the beginning.  So as you follow the author through his reasonings, it is not always obvious where he's leading you.  At the end of the section, there is a QED that often takes you by surprise.  If he had laid down his goals at the onset, I would have been in a better position to appreciate how each step lead me in that direction, instead of being taken by surprise by his conclusions.</p>","publisher":"Viking","titles":[{"link":"http://amzn.com/067003472X","title":"Breaking the Spell: Religion as a Natural Phenomenon"}],"years":["2006"],"name":"Breaking_the_Spell","stop":"2006-06-09","authors":["Daniel C. Dennett"]},{"start":"2006-03-22","publisher":"Grasset","titles":[{"title":"La myst&eacute;rieuse flamme de la reine Loana","link":"http://www.amazon.ca/dp/2246670810"},{"title":"<i>The Mysterious Flame of Queen Loana</i>","link":"http://amzn.com/0151011400"},{"title":"<i>La misteriosa fiamma della regina Loana</i>","link":null}],"body":"<p>My other favorite author.  Usually not an easy read, but you end up less stupid for it.</p><p>The main character lost his memory and relives his childhood by examining the litterature he was reading as a child in fascist Italy: comic books, translated novels, fascist propaganda.  It is a very good look at a fascinating world.  Later, when the main character regains his memory, he takes stock of his life and looks at how his life was shaped by patterns and events in his youth and teenage years.</p><p>I was a little puzzled by the ending.  I will need to reflect upon it a little while longer.  I think it ties to his appreciation of Cyrano de Bergerac earlier in the book.  I guess that makes it the most desireable ending one could have hoped for.</p><p>This book brought back memories.  Just as the main character is revisiting his past, rediscovering his childhood based on what he read at the time, I was also going through my childhood, the books I was readings, and how they affected me.  Thank you, Mr. Eco, for this stroll down memory lane.</p>","acquired":null,"name":"La_misteriosa_fiamma_della_regina_Loana","authors":["Umberto Eco"],"stop":"2006-04-25","years":["2004"]},{"name":"God_s_Debris","stop":"2006-03-20","authors":["Scott Adams"],"years":["2001"],"start":"2006-02-23","body":"<p>Goes back and forth between highfalutin pop psychology and science fiction.  The reader must remember that the author is not a philosopher by training.</p><p>Part of the problem, for me, is that at first, the book asks you to challenge your assumptions, but then presents a farfetched model that can be neiher proven nor disproved and asks you to accept it wholesale.</p><p>It's a nice exercise at challenging assumptions and trying to prove absurd things just for the sake of logical argument.</p>","publisher":"Andrew McMeel Publishing","titles":[{"title":"God's Debris","link":"http://www.andrewsmcmeel.com/godsdebris/"}],"acquired":null},{"acquired":null,"publisher":"Delacorte Press","titles":[{"title":"The Google Story","link":"http://amzn.com/055380457X"}],"body":"<p>I work there now.  I started at Google at the end of August 2005, right about the time the book ends.  What's more, I came to the Bay Area in 1999, around the same time that Google started really taking off.  I still remember the first time a friend mentioned Google to me, a new search engine that had a new page ranking system.  I wasn't convinced at first and it took me a few years before I finally switched to Google for my web searches.  Old habits die hard.</p><p>As I read through the book, going through the years, I could compare what was happening at Google to what I was doing at the time.  What was I doing wherever instead of being where the action was at?</p><p>The authors are clearly big fans of Google and Larry and Sergey.  At times, the are clearly gushing, including the parts about Larry and Sergey's childhood.  But overall, the book is very informative and clearly relates the spirit of innovation and caring that is the Google culture.</p>","start":"2006-01-03","years":["2005"],"authors":["David A. Vise","Mark Malseed"],"stop":"2006-02-01","name":"The_Google_Story"},{"body":"<p>Malcolm Gladwell was giving a talk at my office.  He was very lively and a great speaker.  He had some ideas that seemed controversial, or at least outside the mainstream.  He definitely piqued my curiosity.  I got the book for free, but now I might just go out and buy his previous book too. <i>(As a follow up, someone did give it to me as a Christmas 2005 present.)</i></p><p>Malcolm Gladwell deals with subjects from the world of science, but he is a preacher at heart.  He cites the works of others, but only papers that support his position.  He does not present a balanced view of the topics and you have to take him at his word that his experts are at the top of their field.</p><p>The scientific approach shows all the evidence, even the contrary one, and builds a theory that encompasses all data.  It lets you come to your own conclusions, based on the evidence.  Science requires unbiased knowledge.  A preacher, by opposion, asks that you accept his opinion at face-value.  He presents a single point of view and holds it as the unquestionable truth from then on.  His job is simply to convince you that he is right.  Preaching only requires faith, which has a lower burden of proof.  As I read the book, I felt that it asked for more faith in the author and his ideas rather instead of offering comprehensive and unbiased knowledge about the issues, and it did bother me a bit.</p><p>The book still made for a very good read.  The ideas are definitely stimulating and can prompt you to reconsider the weight you place on first impressions.</p>","publisher":"Little, Brown and Company","titles":[{"title":"Blink","link":"http://amzn.com/0316172324"}],"start":"2005-10-26","acquired":null,"stop":"2005-11-09","authors":["Malcolm Gladwell"],"name":"Blink","years":["2005"]},{"years":["2005"],"stop":"2005-09-02","authors":["Milan Kundera"],"name":"Le_rideau","acquired":null,"body":"<p>I love reading Kundera.  He opens my mind to the arts and makes me want to know so much more.  This book is no different.</p><p>In this essay, Kundera explores further the nature of his art form: the novel.  He starts with an interesting idea that nothing happens in a vacuum and that art pieces take their value from their place in a continuum.  If a composer, today, wrote a piece exactly like Beethoven, it would be worthless.  The same piece, written in the days of Beethoven, would be a masterpiece.  The music continuum has moved forward and a given piece of music has a different value depending on where it is located in that continuum.  In the book, Kundera will try to map the continuum of the artform of the novel and highlight some of its landmarks.</p><p>The first roadblock is that the history of an art is not tied to that of any one nation.  The evolution of a given art moves between countries without consideration for their individual national histories.  But each culture tends to highjack its artists in order to affirm itself in the face of the world.  Kundera calls it <i>provincialism</i>, or narrow-mindedness.</p><p>And this is where Kundera's genius starts to show.  He grew up in Czechoslovakia and later emigrated to France.  He knows what it is like to be part of a culture that plays a small part in the world of literature, and to join a culture that plays a large part in it.  Each sees itself differently in how it relates to the rest of the world, and in how it deals with both its own artists and artists of other nations.</p><p>When he describes the <i>narrow-mindedness of the small</i>, I can hear echoes of opinions expressed in my native Qu&eacute;bec;  even though he is talking about Czechoslovakia, he could just as well be talking about the people and attitudes that I grew up with.  Small nations hang on to their culture so they don't get swallowed by their larger context.  Their artists are what keeps them distinct.  For an artist to leave their narrow context in order to take part in the greater world is nothing short of treason.</p><p>Now that I live in the United States, I can also relate to what he calls the <i>narrow-mindedness of the great</i>.  After all, the US is a country that has what it calls a \"World Series\" with the US as the only participating nation.  :-)  Great nations come to think that their culture is sufficient; after all, why would anyone need anything more?</p><p>From there, Kundera proceeds down the road of the evolution of the novel as an art form through the ages.  Starting with Rabelais and Cervantes, and going through a series of authors from the four corners of the western world, he explores the characteristics that are unique to the novel.  Novels explore human nature by looking at the mundane in the characters and showing them as products of their surroundings.  This is in contrast to the preceding literature where characters were predestined by their origin and dealt with profound moral choices.</p><p>At one point, Kundera comments on the nature of tragedy.  Two characters hold on to two sides of a same coin and neither can win without destroying the other, thereby bringing their own downfall.  Each side becomes both justified and guilty at the same time. There lies the essence of tragedy, and with it, the possibility of reconciliation when both sides accept their share of guilt.  It shows the relativistic nature of what we hold to be true.  This way of thinking stopped after World War II; manichaeism reasserted its place and the world became black and white again, out went any relativism, and it took guilt and any hope for reconciliation with it.  From then on, it's been us versus them.</p><p>The last thing I want to cover is Kundera's treatment of bureaucracy through the works of Adalbert Stifter, Max Weber, and Franz Kafka.  In a bureaucracy, the employee is not expected to understand the problems his office is dealing with, but rather to blindly execute the orders given to him.  Stifter's character cannot help dealing with things according to their nature and therefore finds himself ill-suited for being part of a bureaucracy.  By the time we get to Kafka, the bureaucracy has become omnipresent and there is no escaping it anymore.  Here, I find a parallel with my work as a software engineer.  I am actively fleeing bureaucracy in my work life; I want to deal with problems, not blindly follow instructions that come from someone else.  It is interesting to see how people that are otherwise well-intentioned can nonetheless fall into the trap of bureaucracy and create these large structures from which all thinking has been removed.</p><p>Kundera is much more eloquent than me, so get this book and read it for yourself.</p>","publisher":"Gallimard","titles":[{"title":"Le rideau","link":"http://www.amazon.ca/dp/207077435X"},{"title":"<i>The Curtain</i>","link":"http://amzn.com/0060841958"}],"start":"2005-08-24"},{"acquired":null,"body":"<p>Less whiny than the previous installment.  Not quite as long either.  That's two good starting points.  A lot of the action is rather simplistic but makes for entertaining reading.  It'll make a good movie when they get around to it.</p><p>I think Rowling fell into a trap of her own making.  She first conceived the series where each book spans one school year at Hogswart.  At first, this is nice because the novel can take its pace from the various milestones in the school year: holidays, exams, etc.  But it also forces her to sometimes stretch the action in ways that seem unnatural.  For instance, Harry gets assigned an important task and he does nothing about it for a full month until the next available school calendar milestone.  He knew the task was critical in a scope much larger than the school, and yet he does nothing about it.  A lot of elements in the book lend themselves to this kind of urgency and end up being delayed, apparently for the sake of ending as the same time as the school year instead of well before, say, Halloween.</p><p>In the American edition, each chapter is headed by a small vignette that illustrates some of the action in that chapter.  After I had read Chapter 4 (of 30), I decided to look ahead at all the chapter titles and vignettes, just out of curiosity.  Now, when you look at a small image on top of some words, it is very hard not to ignore said words, especially when they are highlighted one way or another.  The same goes for the text on the facing page.  This is how I came upon the major event of the novel, which occurs in the last few paragraphs of Chapter 27 and continues in the opening paragraphs of Chapter 28.  But I was not ready, yet!  I was still on Chapter 4!  Damn those authors that but a chapter break right in the middle of the key event in their novel!  Some would say I shouldn't have been reading ahead in the first place, that I got what I justly deserved.  \"Curiosity killed the cat,\" and all that nonesense.  Phooey.</p><p>Still, a very enjoyable installment in the Harry Potter series.  It reminded me of <a target=\"_blank\" href=\"http://amzn.com/0439136350\">Harry Potter and the Prisoner of Azkaban</a> in the complexity of the intrigue and the level of background exposition for the world of Harry Potter.  But don't go and read ahead; trust me on this.</p>","publisher":"Scholastic","titles":[{"link":"http://amzn.com/0439784549","title":"Harry Potter and the Half-Blood Prince"}],"start":"2005-07-16","years":["2005"],"stop":"2005-07-27","authors":["J. K. Rowling"],"name":"Harry_Potter_and_the_Half_Blood_Prince"},{"stop":"2005-06-29","authors":["Charles Baudelaire"],"name":"Les_fleurs_du_mal","years":["1861"],"body":"<p>Second reading.  I first read it as a teenager back in highschool and I only remember that I had liked it a lot.  Having mostly forgotten it all, I'm decided to have another go at it and see if I still relate to it as a grownup.</p><p>I have a new found appreciation for the power of metaphor and the work of the poet.</p><p>Some quick, rough notes:</p><p>It is pointless for the artist to explain himself to others.  People with the right sensibility will understand on their own those without will never understand anyway.</p><p><i>Le voyage</i> and the principle of \"<i>la fuite en avant</i>.\"</p>","titles":[{"title":"Les fleurs du mal","link":"http://www.amazon.ca/dp/2070315088"},{"link":"http://amzn.com/0192835459","title":"<i>The Flowers of Evil</i>"}],"publisher":"Gallimard","start":"2005-06-10","acquired":null},{"body":"<p>Second reading.</p><p>Essay about the nature of mediated experiences and the trade offs we make between being in control and being able to do complex things.  He uses the history of operating systems between Apple, Microsoft, and Linux to illustrate the discourse and draws parallels with the evolution of culture and pop-psychology.</p><p>I've enjoyed Stephenson's fiction writings and this is a smart essay where he shows that he's a geek too.  Some of the Windows versus MacOS is starting to show its age, but the points about mediated experiences are still valid.  A good, quick read.</p>","publisher":"Avon Books","titles":[{"link":"http://amzn.com/0380815931","title":"In the Beginning...was the Command Line"}],"start":"2005-05-06","acquired":null,"stop":"2005-05-13","authors":["Neal Stephenson"],"name":"In_the_Beginning_was_the_Command_Line","years":["1999"]},{"start":"2005-01-11","publisher":"Metropolitan Books","titles":[{"link":"http://amzn.com/0805074007","title":"Hegemony or Survival"}],"body":"<p>Diatribe against American imperial policies.</p><p>Early on, Chomsky warns his reader not to confuse state power with a country and its people.  One can be critical of state policy while praising the country and its culture.  Interestingly enough, one reviewer on <a target=\"_blank\" href=\"http://www.amazon.com/exec/obidos/tg/cm/member-glance/-/A3JFR4ZGABKIP2/1/ref=cm_cr_auth/103-4247903-3743005?_encoding=UTF8\">Amazon.com</a> has fallen into that trap and assumes that since Chomsky is critical of the current administration, he must hate America too.</p><p>Chomsky documents how the <a target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Monroe_Doctrine\">Monroe Doctrine</a> has shaped American policy, both foreign and domestic for the past 150 years.  He uses newspaper articles, declassified documents, and political analysis to show how successive administrations have built up their military supremacy to an unparalleled level while at the same time taming the \"great beast\" of public opinion, giving them the freedom to use that power to the benefit of the national elite.  Examples come from involvements in Central and South America, the Cold War including the Cuban Missile Crisis, to the post-Soviet era and the war on terror, to the war in Iraq.  The progression is quite frightening.</p><p>The book includes 28 pages (10%) of notes listing sources for each quotes, and a 12-page index.  You can check out his facts for yourself, if you have the time and patience to track down all those sources.</p><p><span class=\"newthought\">Note:</span> If you look at the dates during which I was reading this book, you will see that they coincide with George W. Bush's second inaugural address (2005-01-20).  In it, President Bush put forth a goal to promote freedom in the world.  The future will tell if this was the latest incarnation of the Monroe Doctrine.  In reaction to the inaugural speech, the New York Times published, on January 30, an op-ed by Tom Wolfe tying the address to the Monroe Doctrine and how successive administrations gradually expanded its reach until it spanned the entire globe.</p> ","acquired":null,"name":"Hegemony_or_Survival","authors":["Noam Chomsky"],"stop":"2005-01-28","years":["2003"]},{"publisher":"Les &Eacute;ditions des Intouchables","titles":[{"link":"http://www.amazon.ca/dp/2895491348","title":"Le livre noir du Canada anglais"},{"link":"http://www.amazon.ca/dp/077102259X","title":"<i>The Black Book of English Canada</i>"}],"body":"<p>The author builds up a case that shows how English-speaking Canadians have persecuted the French-speaking population from even before the Conquest in 1763.  Throughout Canada's history, the British colonial powers have repeatedly tried to remove this troublesome population of former French nationals that does not want to disappear from the face of the Earth quietly.</p><p>I thought at times the author was piping his own horn.  There are definitely places where he reads much more into what some writers are saying than a normal person would.  But one cannot deny the documented historical events that show dogged determination of WASPs in getting rid of everyone else.</p><p>Like Michael Moore, you must take this book with an appropriate amount of salt.  It is an opinion piece by its author and one must read it in that light.  Nonetheless, the work is very well documented and is a great refresher course in Canadian history, even if it focuses on all the not-so-great aspects of it.</p>","start":"2004-07-12","acquired":null,"authors":["Normand Lester"],"stop":"2004-09-15","name":"Le_livre_noir_du_Canada_anglais","years":["2001"]},{"authors":["Isaac Asimov"],"stop":"2004-10-07","name":"I_Robot","years":["1950"],"publisher":"Doubleday","titles":[{"title":"I, Robot","link":"http://amzn.com/0553803700"}],"body":"<p>Isaac Asimov's seminal novel about robots and how they behave.  This is a collection of short stories that document the evolution of robotic technology in the world of tomorrow and the societal changes they trigger.</p><p>I started reading it in preparation for the <a target=\"_blank\" href=\"http://imdb.com/title/tt0343818/\">movie</a>, knowing full well that the movie has nothing to do with the book, except for the title.  I had bought the novel a long time ago, because it's a classic, and figured I'd read it someday.  So that day has finally come.</p><p>The book is a collection of short stories that were published between 1940 and 1950.  In is interesting to see how the author looked at political development in the future, how in the end, there is a large russo-american block that dominates the planet and an old, decadent Europe that is now good for nothing.  Luckly, things didn't pan out that way (yet), but it gives us an insight in how they saw the world back then and where they saw it going.  It is also curious how to them, atomic energy would become ubiquitous in the future, like in George Orwell's <i>Nineteen Eighty-Four</i> and Ray Bradbury's <i>Fahrenheit 451</i>.</p>","start":"2004-07-03","acquired":null},{"body":"<p>In this novel, the main character searches for the Holy Grail by following clues in Leonardo Da Vinci's artwork.</p><p>I've already read a fair bit about the Knights Templars and grail quests.  It's been done before.  Usually better.  I still think the best novel around these conspiracy theories is still Umberto Eco's <i><a target=\"_blank\" href=\"http://amzn.com/0151327653\">Foucault's Pendulum</a></i>.  Eco's characters obsess about as much about wild conspiracy theories, but at least they get grounded once in a while.</p><p>The characters in <i>The Da Vinci Code</i> weave complex, omnipresent conspiracy theories that fit within Western Christian culture, but fails to take into account some of the other major contributors to Western thought, such as Judaism and Islam.  It bugged me.  That, plus the fact that he placed the action in Paris for effect and uses cute little French sentences to charm the reader.  The problem is that real French people from Paris would not speak like that.  In at least one case, it was a direct translation of an American idiom.  Mr. Brown, you are just plain silly.  By the way, at one point he refers to the Hopi language word <i>Koyaanisquatsi</i>, meaning \"life without balance\".  It is the title of an amazing movie by Godfrey Reggio, which Reggio admitted he invented from two Hopi words: <i>koyaanis</i> for \"out of balance, falling\" and <i>qatsi</i> for \"life, existence\".  The Hopi would combine words to signify concepts, but not the combination <i>koyaanisqatsi</i>, which the director invented for his movie's purpose.  He said so during a panel discussion on the DVD for his other film <i>Naqoyqatsi</i>.</p>","publisher":"Doubleday","titles":[{"link":"http://amzn.com/0385504209","title":"The Da Vinci Code"}],"start":"2004-04-15","acquired":null,"stop":"2004-05-06","authors":["Dan Brown"],"name":"The_Da_Vinci_Code","years":["2003"]}]}
